README.org
#+TITLE: Quarks System Core (QSC)
#+AUTHOR: Chatman R. Jr
#+PROPERTY: header-args :mkdirp yes
#+PROPERTY: header-args:js :results output none :comments link
#+PROPERTY: header-args:deno :allow net :results output code
#+PROPERTY: header-args:shell :results output code

Quarks System Core is a workflow for creating, assembling, and distributing design tokens for and on
the web.

It's part of a growing toolkit called QuarkSuite which focuses on using modern web
technologies to spin up portable, reproducible baselines for web projects.

Think of it like a UI boilerplate generator you can use right in your browser.

Current enhancements to the workflow include Quarks System UI: a tiny collection of web components
for visual development and documentation of Quarks System Dictionaries.

Future enhancements may appear based on community feedback or my own needs.

Quarks System Core is written in web standard JavaScript (ES2015+).

- [[#summary][Summary]]
- [[#features][Features]]
  - [[#color-palettes][Color Palettes]]
  - [[#modular-scales][Modular Scales]]
  - [[#token-formats][Token Formats]]
  - [[#workflow][Workflow]]
- [[#getting-started][Getting Started]]
- [[#installation][Installation]]
  - [[#kitchen-sink][Kitchen Sink]]
  - [[#modular][Modular]]
  - [[#webpackrollup][Webpack/Rollup]]
- [[#examples][Examples]]
  - [[#bleeding-edge-chromium-87][Bleeding Edge (Chromium 87+)]]
    - [[#indexhtml][index.html]]
  - [[#deno-160][Deno (1.6.0+)]]
    - [[#buildjs][build.js]]
    - [[#deno-run][deno run]]
  - [[#node-14160][Node (14.16.0+)]]
    - [[#setup][Setup]]
    - [[#indexjs][index.js]]
    - [[#build][Build]]
  - [[#output][Output]]
- [[#user-guide][User Guide]]
  - [[#basics][Basics]]
    - [[#requirements][Requirements]]
    - [[#color][Color]]
      - [[#1-set-a-base-color][1. set a base color]]
      - [[#2-generate-a-color-scheme][2. generate a color scheme]]
      - [[#3-complete-the-palette][3. complete the palette]]
    - [[#typography][Typography]]
      - [[#1-set-fonts-and-styles][1. set fonts and styles]]
      - [[#2-creating-a-text-size-scale][2. creating a text size scale]]
    - [[#layout][Layout]]
      - [[#1-create-a-measureline-length-scale][1. create a measure/line length scale]]
      - [[#2-create-vertical-rhythmspacing-scale][2. create vertical rhythm/spacing scale]]
  - [[#design-tokens][Design Tokens]]
    - [[#interlude-quarks-system-dictionary][Interlude: Quarks System Dictionary]]
      - [[#value][Value]]
      - [[#scale][Scale]]
      - [[#subcategory][Subcategory]]
      - [[#hierarchy][Hierarchy]]
        - [[#context][Context]]
        - [[#namespace][Namespace]]
    - [[#assemble][Assemble]]
    - [[#build-1][Build]]
    - [[#output-1][Output]]
      - [[#tokenscss][tokens.css]]
      - [[#tokensjson][tokens.json]]
  - [[#recap][Recap]]
  - [[#introduction-to-advanced-concepts][Introduction to Advanced Concepts]]
    - [[#bound-utilities][Bound Utilities]]
    - [[#data-pipelines][Data Pipelines]]
    - [[#configurationsformulas][Configurations/Formulas]]
  - [[#applying-advanced-concepts][Applying Advanced Concepts]]
    - [[#formulasjs][formulas.js]]
      - [[#requirements-1][Requirements]]
      - [[#color-1][Color]]
        - [[#1-create-a-palette-formula][1. create a =Palette= formula]]
      - [[#typography-1][Typography]]
        - [[#1-create-a-stack-formula][1. create a =Stack= formula]]
        - [[#2-create-a-content-configuration][2. create a =Content= configuration]]
        - [[#3-use-the-content-configuration-to-create-a-size-formula][3. use the =Content= configuration to create a =Size= formula]]
      - [[#layout-1][Layout]]
        - [[#1-create-a-measure-formula][1. create a =Measure= formula]]
        - [[#2-use-the-content-configuration-to-create-a-spacing-formula][2. use the =Content= configuration to create a =Spacing= formula]]
    - [[#dictjs][dict.js]]
      - [[#1-import-the-formulas-and-define-settings][1. import the formulas and define settings]]
      - [[#2-construct-the-dictionary][2. construct the dictionary]]
    - [[#buildjs-1][build.js]]
      - [[#1-import-token-functions-and-dictionary][1. import token functions and dictionary]]
      - [[#2-build-tokens][2. build tokens]]
    - [[#run][run]]
- [[#source-code][Source Code]]
  - [[#module-api][Module API]]
    - [[#utilities-utilitiesjs][Utilities (=utilities.js=)]]
      - [[#compose][compose]]
      - [[#pipe][pipe]]
      - [[#tests][Tests]]
        - [[#utilities-assertions][Utilities Assertions]]
        - [[#utilities-results][Utilities Results]]
    - [[#color-colorjs][Color (=color.js=)]]
      - [[#format-conversion][Format Conversion]]
        - [[#hex][hex]]
        - [[#rgb][rgb]]
        - [[#hsl][hsl]]
        - [[#cmyk][cmyk]]
        - [[#hwb][hwb]]
        - [[#cielab][cielab]]
        - [[#cielch][cielch]]
        - [[#oklab][oklab]]
        - [[#compare][compare]]
        - [[#tests-1][Tests]]
          - [[#color-format-conversion-assertions][Color Format Conversion Assertions]]
          - [[#color-format-conversion-results][Color Format Conversion Results]]
      - [[#properties-adjustment][Properties Adjustment]]
        - [[#adjust][adjust]]
        - [[#tests-2][Tests]]
          - [[#color-adjustment-assertions][Color Adjustment Assertions]]
          - [[#color-adjustment-results][Color Adjustment Results]]
      - [[#color-mixture][Color Mixture]]
        - [[#mix][mix]]
        - [[#tests-3][Tests]]
          - [[#color-mixture-assertions][Color Mixture Assertions]]
          - [[#color-mixture-results][Color Mixture Results]]
      - [[#scheme-generation][Scheme Generation]]
        - [[#complementary][complementary]]
        - [[#analogous][analogous]]
        - [[#splitcomplementary][splitComplementary]]
        - [[#triadic][triadic]]
        - [[#tetradic][tetradic]]
        - [[#square][square]]
        - [[#custom][custom]]
        - [[#tests-4][Tests]]
          - [[#color-scheme-generation-assertions][Color Scheme Generation Assertions]]
          - [[#color-scheme-generation-results][Color Scheme Generation Results]]
      - [[#color-scales][Color Scales]]
        - [[#tints][tints]]
        - [[#tones][tones]]
        - [[#shades][shades]]
        - [[#tests-5][Tests]]
          - [[#color-scale-assertions][Color Scale Assertions]]
          - [[#color-scale-results][Color Scale Results]]
      - [[#color-accessibility][Color Accessibility]]
        - [[#clrs][clrs]]
        - [[#contrast][contrast]]
        - [[#tests-6][Tests]]
          - [[#color-accessibility-assertions][Color Accessibility Assertions]]
          - [[#color-accessibility-results][Color Accessibility Results]]
    - [[#typography-typographyjs][Typography (=typography.js=)]]
      - [[#systemfonts][systemfonts]]
      - [[#tests-7][Tests]]
        - [[#typography-assertions][Typography Assertions]]
        - [[#typography-results][Typography Results]]
    - [[#modular-scale-modular_scalejs][Modular Scale (=modular_scale.js=)]]
      - [[#create][create]]
      - [[#update][update]]
      - [[#merge][merge]]
      - [[#chunk][chunk]]
      - [[#units][units]]
      - [[#tests-8][Tests]]
        - [[#modular-scale-assertions][Modular Scale Assertions]]
        - [[#modular-scale-results][Modular Scale Results]]
    - [[#design-token-output-formats-design_tokensjs][Design Token Output Formats (=design_tokens.js=)]]
      - [[#css-design_tokensjs][CSS (=design_tokens.js=)]]
        - [[#css][css]]
        - [[#sass][sass]]
        - [[#less][less]]
        - [[#styl][styl]]
        - [[#tests-9][Tests]]
          - [[#css-format-assertions][CSS Format Assertions]]
          - [[#css-format-results][CSS Format Results]]
      - [[#data-export-design_tokensjs][Data Export (=design_tokens.js=)]]
        - [[#raw][raw]]
        - [[#yaml][yaml]]
        - [[#tests-10][Tests]]
          - [[#data-export-assertions][Data Export Assertions]]
          - [[#data-export-results][Data Export Results]]
      - [[#data-transforms-design_tokensjs][Data Transforms (=design_tokens.js=)]]
        - [[#tailwind][tailwind]]
        - [[#styledict][styledict]]
        - [[#tests-11][Tests]]
          - [[#data-transform-assertions][Data Transform Assertions]]
          - [[#data-transform-results][Data Transform Results]]
  - [[#internals][Internals]]
    - [[#error-handling-internalserrorjs][Error Handling (=internals/error.js=)]]
    - [[#color-2][Color]]
      - [[#supported-formats-internalscolorformatsjs][Supported Formats (=internals/color/formats.js=)]]
        - [[#syntax-tokens][Syntax Tokens]]
        - [[#value-extractors][Value Extractors]]
        - [[#rgb-hex][RGB Hex]]
          - [[#hex-validator][Hex Validator]]
          - [[#hex-value-extraction][Hex Value Extraction]]
        - [[#named-colors][Named Colors]]
        - [[#functional-rgb][Functional RGB]]
          - [[#rgb-validator][RGB Validator]]
          - [[#rgb-value-extraction][RGB Value Extraction]]
        - [[#functional-hsl][Functional HSL]]
          - [[#hsl-validator][HSL Validator]]
          - [[#hsl-value-extraction][HSL Value Extraction]]
        - [[#device-cmyk][Device CMYK]]
          - [[#cmyk-validator][CMYK Validator]]
          - [[#cmyk-value-extraction][CMYK Value Extraction]]
        - [[#functional-hwb][Functional HWB]]
          - [[#hwb-validator][HWB Validator]]
          - [[#hwb-value-extraction][HWB Value Extraction]]
        - [[#functional-cielab][Functional CIELAB]]
          - [[#cielab-validator][CIELAB Validator]]
          - [[#cielab-value-extraction][CIELAB Value Extraction]]
        - [[#functional-cielchab][Functional CIELCh(ab)]]
          - [[#cielchab-validator][CIELCh(ab) Validator]]
          - [[#cielchab-value-extraction][CIELCh(ab) Value Extraction]]
        - [[#oklab-lch][Oklab (LCh)]]
          - [[#oklab-lch-validator][Oklab (LCh) Validator]]
          - [[#oklab-lch-value-extraction][Oklab (LCh) Value Extraction]]
        - [[#batch-validation][Batch Validation]]
      - [[#format-conversions-internalscolorconversionsjs][Format Conversions (=internals/color/conversions.js=)]]
        - [[#rgb-hex-conversions][RGB Hex Conversions]]
          - [[#rgb-hex-to-functional-rgb][RGB Hex to Functional RGB]]
        - [[#named-color-conversion][Named Color Conversion]]
          - [[#rgb-hex-from-named-color][RGB Hex from Named Color]]
        - [[#functional-rgb-conversion][Functional RGB Conversion]]
          - [[#rgb-hex-from-functional-rgb][RGB Hex from Functional RGB]]
          - [[#functional-rgb-to-functional-hsl][Functional RGB to Functional HSL]]
          - [[#functional-rgb-to-device-cmyk][Functional RGB to Device CMYK]]
          - [[#functional-rgb-to-functional-hwb][Functional RGB to Functional HWB]]
          - [[#functional-rgb-to-functional-cielab][Functional RGB to Functional CIELAB]]
          - [[#functional-rgb-to-oklab-lch][Functional RGB to Oklab (LCh)]]
        - [[#functional-hsl-conversion][Functional HSL Conversion]]
          - [[#functional-rgb-from-functional-hsl][Functional RGB from Functional HSL]]
        - [[#device-cmyk-conversion][Device CMYK Conversion]]
          - [[#functional-rgb-from-device-cmyk][Functional RGB from Device CMYK]]
        - [[#functional-hwb-conversion][Functional HWB Conversion]]
          - [[#functional-rgb-from-functional-hwb][Functional RGB from Functional HWB]]
        - [[#functional-cielab-conversion][Functional CIELAB Conversion]]
          - [[#functional-rgb-from-functional-cielab][Functional RGB from Functional CIELAB]]
          - [[#functional-cielab-to-functional-cielchab][Functional CIELAB to Functional CIELCh(ab)]]
        - [[#functional-cielch-conversion][Functional CIELCh Conversion]]
          - [[#functional-cielab-from-functional-cielchab][Functional CIELAB from Functional CIELCh(ab)]]
        - [[#oklab-lch-conversion][Oklab (LCh) Conversion]]
        - [[#batch-conversion][Batch Conversion]]
      - [[#math-internalscolormathjs][Math (=internals/color/math.js=)]]
  - [[#data][Data]]
    - [[#color-3][Color]]
      - [[#w3c-x11-color-definitions-datacolorw3c-x11js][W3C X11 Color Definitions (=data/color/w3c-x11.js=)]]
      - [[#accesible-web-defaults-datacolora11yjs][Accesible Web Defaults (=data/color/a11y.js=)]]
    - [[#typography-2][Typography]]
      - [[#system-font-stacks-datatypographysystemjs][System Font Stacks (=data/typography/system.js=)]]

* Summary

This document is a literate program structured to introduce you to Quarks System Core from a
top-down view. Sections representing source code are marked with their relative location in the
repository and are generously annotated, so if the literal style isn't your jam, you can still read the source itself.

* Features

** General Setup

+ Nothing to install
+ Universal but web focused

** Developer Experience

+ Get started immediately with a single function
+ Power tools available as needed

** Design Tokens

*** Output

+ CSS custom properties
+ Preprocessor variables
+ General data exporting
+ Desktop app support
+ Integration with TailwindCSS and Style Dictionary

*** Color

+ Robust premade palette configurations
+ Full support for current and emerging CSS formats
+ Wield color like a color scientist
+ Built-in Colors project defaults for rapid prototyping

*** Typography

+ System font stacks provided for native OS typography or just to have better fallbacks

*** Modular Scales

+ Enforce consistency in your values
+ Merge, modify, and chunk scales according to your needs
+ Attach units when you're ready to roll

* Just Looking Around

If you just want to inspect what the library makes available and play around with it, load up your
console in a modern browser or run a =deno repl= and paste:

#+BEGIN_SRC js
const QSC = await import("https://x.nest.land/quarksuite:core@1.0.0/main.js");
#+END_SRC

* Getting Started

When you're ready to start a real project with Quarks System Core, get situated with the following
setup code.

#+BEGIN_SRC js
import { QuarksSystemDictionary } from "https://x.nest.land/quarksuite:core@1.0.0/main.js";

QuarksSystemDictionary({}); // empty object generates from default settings
#+END_SRC

That's all you need in native ES Module environments.

** Offline

For an offline workflow, you can =curl= the package source directly.

#+BEGIN_SRC shell
curl -o /path/to/your/local/copy.js https://raw.githubusercontent.com/quarksuite/core/main/mod.js
#+END_SRC

** What About Node?

Using Quarks System Core with Node requires a bit extra, because the runtime doesn't /natively/
support ES Module importing from URLs.

That said, plenty of modern build tools and dev environments in the Node ecosystem /do/. I highly
recommend native ESM dev servers ([[https://www.snowpack.dev/ ][Snowpack]], [[https://vitejs.dev/][Vite]], [[https://kit.svelte.dev/][SvelteKit]], [[https://modern-web.dev/docs/dev-server/overview/][Web Dev Server]], [[https://github.com/preactjs/wmr][WMR]]) when using QSC in
a Node environment.

#+BEGIN_SRC js
export default {
  quarks: {
    color: Palette(color),
    text: {
      body: Stack("Zilla Slab", "serif"),
      headings: Stack("Rubik"),
      code: Stack(null, "monospace"),
      leading: { base: 1.5, tight: 1.25, loose: 1.75 },
      style: { extralight: 100, regular: 400, bold: 700, black: 900 },
      size: Size(scale),
    },
    content: {
      line: Measure(48, 72, scale),
      spacing: Spacing(scale.reverse()),
    },
  },
};
#+END_SRC

*** build.js

**** 1. import token functions and dictionary

#+BEGIN_SRC js
import { exists } from "https://deno.land/std@0.92.0/fs/exists.ts";
import {
  css,
  raw,
} from "https://x.nest.land/quarksuite:core@0.2.1/design_tokens.js";
import { default as dict } from "./dict.js";
#+END_SRC

