README.org
**** 2. build tokens

#+BEGIN_SRC js
async function main() {
  const encoder = new TextEncoder();
  const path = "tokens";
  const build = () => [
    [css, "index.css"],
    [raw, "index.json"]
  ].forEach(([format, target]) =>
    Deno.writeFile(`${path}/${target}`, encoder.encode(format(dict))));

  if (await exists(path)) {
    build();
  } else {
    await Deno.mkdir(path);
    build();
  }
}

main();
#+END_SRC

*** run

#+BEGIN_SRC shell
deno run --allow-read --allow-write ./build.js
#+END_SRC

* Source Code
** Module API

The API is organized by the kind of data each function accepts.

This means you can jump right to the section for what you need to do. The literate style isn't for
everyone, so headings are appropriately marked with their source location in the repo if you prefer
to leap right into code.

Each section is broken down into:

+ functions: the actual function definitions with developer commentary
+ Tests: proving each function does its job and doesn't choke on the unexpected

As a rule, any files in the project root are public modules while any files in directories are
internal utilities.

Most who use this library will want to import the =mod.js= entry point, but if you only need parts
of it, I recommend and encourage importing directly from the modules that fit your purpose.

#+BEGIN_SRC js :tangle "./mod.js" :comments link
export * from "./utilities.js";
export * from "./color.js";
export * from "./typography.js";
export * from "./modular_scale.js";
export * from "./design_tokens.js";
#+END_SRC

*** Utilities (=utilities.js=)

The Quarks System Core rests on a functional base. It uses a data-last architecture and the
following utilities are designed to take full advantage of this decision.

**** compose

+ =compose: (...operators: Array<(data: any) => any>) => (data: any) => any=
+ =operators: Array<(data: any) ==> any>=: a sequence of data operators


Two conditions must be met for composition:

+ all operators must be functions
+ all functions must be monadic ( =(data: any) => any=)

#+BEGIN_SRC js :tangle "./utilities.js" :comments link
import { ErrorTemplate } from "./internals/error.js";

// Error handling
const isFunction = (x) => typeof x === "function";

/** Error thrown when value is not a function. */
const FuncError = (output) =>
  ErrorTemplate({
    message: "not a function",
    reason: `
This error indicates that one or more of the values is not a
function, so it can't be composed.
`,
    suggestion: `
Check that every value in your composition chain is a function.
`,
    output,
  });

/**
 * A higher order function that accepts a sequence of data operators and combines them
 * into a new function waiting for data.
 *
 * @example Splitting a string after upcasing it.
 *
 * ```ts
 *  const upper = (data) => data.toUpperCase();
 *  const split = (data) => data.split("");
 *
 *  const splitCapitalLetters = compose(upper, split);
 *
 *  splitCapitalLetters("hello"); // ["H", "E", "L", "L", "O"]
 * ```
 *
 * @remark
 * A data operator is also called a unary function. These are both ways of saying a function
 * takes a single argument.
 *
 * @param {((data: any) => any)[]} operators - a sequence of functions to combine
 * @returns {(data: any) => any} the composed function waiting for data  */
export function compose(...operators) {
  return (data) =>
    operators.reduce((value, func) => {
      if (!isFunction(func)) return FuncError(func);
      return func(value);
    }, data);
}
#+END_SRC

**** pipe

+ =(data: any, ...operators: Array<(data: any) => any>) => unknown=
+ =data: unknown=: the data to pass through the pipeline
+ =...operators: Array<(data: any) => any>=: a sequence of data operators

=pipe= inverts the relationship between data and its operators. This is crucial because data
pipelines can be bound (with =Function.bind=)which allows the construction of /queued/ data
transformers.

As you can see, it's a reimplementation of =compose= but with the data as the initial argument and
immediately executes on call.

#+BEGIN_SRC js :tangle "./utilities.js" :comments link
/**
 * A higher order function that pipes data through a sequence of functions and
 * outputs the result.
 *
 * @example Transforming a string into an upcased array.

 * ```ts
 * const upper = (data) => data.toUpperCase();
 * const split = (data) => data.split("");
 *
 * pipe("hello", upper, split); // ["H", "E", "L", "L", "O"]
 * ```
 *
 * @remarks
 * This function simply inverts `compose` so that the data is immediately transformed
 * instead of combining the functions.
 *
 * @param {any} data - the data to pass through the pipeline
 * @param {((data: any) => any)[]} operators - the sequence of functions to transform data
 * @returns {any} The transformed data
 */
export function pipe(data, ...operators) {
  return compose(...operators)(data);
}
#+END_SRC

**** Tests

***** Utilities Assertions

#+BEGIN_SRC js :tangle "./tests/utilities_test.js" :comments link
import { compose, pipe } from "../utilities.js";

import {
  assertEquals,
  assertThrows,

} from "https://deno.land/std@0.86.0/testing/asserts.ts";

const isString = (x) => typeof x === "string";
const isArray = (x) => Array.isArray(x);

const upper = (x) => isString(x) && x.toUpperCase();
const lower = (x) => isString(x) && x.toLowerCase();

const trim = (x) => isString(x) && x.trim();

const split = (x) => isString(x) && x.split("");

const box = (x) => [x];
const unbox = (x) => isArray(x) && x.toString();

Deno.test("SPEC compose: combines two data operators", function () {
  const splitSafe = compose(split, unbox);
    assertEquals(splitSafe("hello"), "h,e,l,l,o");
});

Deno.test("SPEC compose: can combine a chain of data operators", function () {
  const upperSplitSafe = compose(trim, upper, split);
  assertEquals(upperSplitSafe("   hello      "), ["H", "E", "L", "L", "O"]);
});

Deno.test("EDGE compose: rejects values that are not functions", function () {
  const failsFuncClause = compose(split, 5);
  assertThrows(
    () => {
      throw failsFuncClause("hello");
    },
    undefined,
    "not a function",
  );
});

Deno.test("SPEC pipe: can transform data", function () {
  assertEquals(pipe("hello", upper), "HELLO");
});

Deno.test("SPEC pipe: can chain operators", function () {
  assertEquals(
    pipe(
      "hello",
      split,
      (x) => x.map((xs) => xs.charCodeAt(0)),
      (x) => x.map((xs) => xs + 16),
      (x) => x.map((xs) => String.fromCharCode(xs)),
      (x) => x.join(""),
    ),
    "xu||\x7f",
  );
});
#+END_SRC

***** Utilities Results

#+BEGIN_SRC shell
printf '%s\n' (NO_COLOR=true deno test ./tests/utilities_test.js)
#+END_SRC

#+NAME: utilities-test
#+begin_src shell
running 5 tests
test SPEC compose: combines two data operators ... ok (5ms)
test SPEC compose: can combine a chain of data operators ... ok (2ms)
test EDGE compose: rejects values that are not functions ... ok (3ms)
test SPEC pipe: can transform data ... ok (1ms)
test SPEC pipe: can chain operators ... ok (2ms)

test result: ok. 5 passed; 0 failed; 0 ignored; 0 measured; 0 filtered out (14ms)

#+end_src

*** Color (=color.js=)

Quarks System Core is designed to work with all valid CSS color formats (current and future). The
color module provides utilities for conversion, modification, mixing, generating schemes, and
creating palettes.

**** Format Conversion

The implementation for format conversion is simplified even further as of v0.3.0.

I realized that the common trait all of the formats shared is that to be usable on the web, they
/must/ stay within the sRGB gamut.

So the logical chain is:

1. Convert a valid color to RGB implicitly
2. Convert to the desired =output= /explicitly/

All the conversion interface needs to know is =from[input] -> to[output]=.

The input format is gleaned from an identification key attached to the supported format's
validator. And it will only work with valid colors, throwing a =ColorError= otherwise.

In addition: =output= can also be a list of formats =["hex", "rgb", "hsl"]= for example. So Quarks
System Core can now provide *batch conversion* functionality.

That part comes later, though.

#+BEGIN_SRC js :tangle "./color.js" :comments link
import formats from "./internals/color/formats.js";
import conversions from "./internals/color/conversions.js";
import { ErrorTemplate } from "./internals/error.js";
import { compose, pipe } from "./utilities.js";

const ColorError = (output) =>
  ErrorTemplate({
    message: "not a valid CSS color format",
    reason: `
This error indicates that the color format is invalid or unsupported.
`,
    suggestion: `
Ensure that the input is a valid CSS color.

Examples:

#deaded
#bea
#face
#abcdef68

aliceblue
rebeccapurple

rgb(110, 33, 229)
rgba(139, 110, 19, 0.5)

hsl(300, 89%, 38%)
hsla(3.4rad, 100%, 25%, 0.99)

device-cmyk(0 1 1 0)
device-cmyk(78% 39% 0 0)

hwb(190 39% 3%)

lab(64% 19 -47)

lch(38% 78 147)
`,
    output,
  });

const validate = (color) =>
  Array.from(formats)
    .map(([supported, validator]) => [supported, validator(color) && color])
    .filter(([, found]) => found)
    .flat();

function queryFormats(output, color) {
  const [input, value] = validate(color);
  const $ = compose;
  const C = pipe;
  const _ = conversions;

  const from = {
    named: $(_.hexFromNamed, _.hexToRGB),
    hex: $(_.hexToRGB),
    rgb: (value) => value, // identity,
    hsl: $(_.rgbFromHSL),
    cmyk: $(_.rgbFromCMYK),
    hwb: $(_.rgbFromHWB),
    cielab: $(_.rgbFromCielab),
    cielch: $(_.cielabFromCielch, _.rgbFromCielab),
    oklab: $(_.rgbFromOklab),
  };

  const to = {
    hex: $(_.hexFromRGB),
    rgb: $(_.hexFromRGB, _.hexToRGB), // identity
    hsl: $(_.rgbToHSL),
    cmyk: $(_.rgbToCMYK),
    hwb: $(_.rgbToHWB),
    cielab: $(_.rgbToCielab),
    cielch: $(_.rgbToCielab, _.cielabToCielch),
    oklab: $(_.rgbToOklab),
  };

  return (
    (value && Array.isArray(output)
      ? output.reduce(
        (acc, format) => ({
          ...acc,
          original: value,
          [format]: C(value, from[input], to[format]),
        }),
        {},
      )
      : value && C(value, from[input], to[output])) || ColorError(color)
  );
}
#+END_SRC

***** hex

+ =hex: (color: string) => string=
+ =color: string=: the input color to convert

#+BEGIN_SRC js :tangle "./color.js" :comments link
/**
 * A function that converts any valid CSS color to RGB hex.
 *
 * @example Converting RGB to RGB Hex
 *
 * ```ts
 * hex("rgb(0, 0, 0)");
 * ```
 *
 * @param {string} color - the input color to convert
 * @returns {string} the input color converted to RGB hex
 */
export function hex(color) {
  return queryFormats("hex", color);
}
#+END_SRC

***** rgb

+ =rgb: (color: string) => string=
+ =color: string=: the input color to convert

#+BEGIN_SRC js :tangle "./color.js" :comments link
/**
 * A function that converts any valid CSS color to RGB.
 *
 * @example Converting RGB Hex to RGB
 *
 * ```ts
 * rgb("#deaded");
 * ```
 *
 * @param {string} color - the input color to convert
 * @returns {string} the input color converted to RGB
 */
export function rgb(color) {
  return queryFormats("rgb", color);
}
#+END_SRC

***** hsl

+ =hsl: (color: string) => string=
+ =color: string=: the input color to convert

#+BEGIN_SRC js :tangle "./color.js" :comments link
/**
 * A function that converts any valid CSS color to HSL.
 *
 * @example Converting Device CMYK to HSL
 *
 * ```ts
 * hsl("device-cmyk(30% 0 60% 0)");
 * ```
 *
 * @param {string} color - the input color to convert
 * @returns {string} the input color converted to HSL
 */
export function hsl(color) {
  return queryFormats("hsl", color);
}
#+END_SRC

***** cmyk

+ =cmyk: (color: string) => string=
+ =color: string=: the input color to convert

#+BEGIN_SRC js :tangle "./color.js" :comments link
/**
 * A function that converts any valid CSS color to CMYK
 *
 * @example Converting HSL to Device CMYK
 *
 * ```ts
 * cmyk("hsl(97, 63%, 81%)");
 * ```
 *
 * @param {string} color - the input color to convert
 * @returns {string} the input color converted to CMYK
 */
export function cmyk(color) {
  return queryFormats("cmyk", color);
}
#+END_SRC

***** hwb

+ =hwb: (color: string) => string=
+ =color: string=: the input color to convert

#+BEGIN_SRC js :tangle "./color.js" :comments link
/**
 * A function that converts any valid CSS color to HWB.
 *
 * @example Converting CIELCH to HWB
 *
 * ```ts
 * hwb("lch(78% 83 210)");
 * ```
 *
 * @param {string} color - the input color to convert
 * @returns {string} the input color converted to HWB
 */
export function hwb(color) {
  return queryFormats("hwb", color);
}
#+END_SRC

***** cielab

+ =cielab: (color: string) => string=
+ =color: string=: the input color to convert

#+BEGIN_SRC js :tangle "./color.js" :comments link
/**
 * A function that converts any valid CSS color to CIELAB.
 *
 * @example Convert HWB to CIELAB
 *
 * ```ts
 * cielab("hwb(90 25% 10%)");
 * ```
 *
 * @param {string} color - the input color to convert
 * @returns {string} the input color converted to CIELAB
 */
export function cielab(color) {
  return queryFormats("cielab", color);
}
#+END_SRC

***** cielch

+ =cielch: (color: string) => string=
+ =color: string=: the input color to convert

#+BEGIN_SRC js :tangle "./color.js" :comments link
/**
 * A function that converts any valid CSS color to CIELCh(ab).
 *
 * @example Convert CIELCh(ab) to RGB Hex
 *
 * ```ts
 * cielch("#face");
 * ```
 *
 * @param {string} color - the input color to convert
 * @returns {string} the input color converted to CIELCh(ab)
 */
export function cielch(color) {
  return queryFormats("cielch", color);
}
#+END_SRC

