README.org
***** splitComplementary

+ =splitComplementary: (color: string) => [string, string, string]=
+ =color: string=: the base color to generate from

#+BEGIN_SRC js :tangle "./color.js" :comments link
/**
 * Creates a split complementary color scheme from any valid CSS color.
 *
 * @example Creaing a split complementary scheme
 *
 * ```ts
 * splitComplementary("coral");
 * ```
 *
 * @remarks
 * A split complementary scheme is composed of a base color and a bisection
 * of colors directly next to its opposite; hues about 30 apart.
 *
 * @param {string} color - the base color to generate from
 * @returns {[string, string, string]} The base hues for a split complementary color scheme
 */
export const splitComplementary = (color) => [
  hue(0, color),
  hue(30, hue(180, color)),
  hue(-30, hue(180, color)),
];
#+END_SRC

***** triadic

+ =triadic: (color: string) => [string, string, string]=
+ =color: string=: the base color to generate from

#+BEGIN_SRC js :tangle "./color.js" :comments link
/**
 * Creates a triadic color scheme from any valid CSS color.
 *
 * @example Creating a triadic color scheme
 *
 * ```ts
 * triadic("coral");
 * ```
 *
 * @remarks
 * A triadic color scheme is composed of three colors evenly spaced around
 * the color wheel; 120 apart.
 *
 * @param {string} color - the base color to generate from
 * @returns {[string, string, string]} The base hues for a triadic color scheme
 */
export const triadic = (color) => [
  hue(0, color),
  hue(120, color),
  hue(240, color),
];
#+END_SRC

***** tetradic

+ =tetradic/dualComplementary: (color: string) => [string, string, string, string]=
+ =color: string=: the base color to generate from

#+BEGIN_SRC js :tangle "./color.js" :comments link
/**
 * Creates a tetradic color scheme from any valid CSS color.
 *
 * @example Creating a tetradic color scheme
 *
 * ```ts
 * tetradic("coral");
 * ```
 *
 * @remarks
 * A tetradic color scheme consists of a color, its opposite, and a
 * second complementary pair of colors. They are also called dual
 * complementary schemes.
 *
 * @param {string} color - the base color to generate from
 * @returns {[string, string, string, string]} The base hues for a tetradic color scheme
 */
export const tetradic = (color) => [
  hue(0, color),
  hue(60, color),
  hue(180, color),
  hue(60, hue(180, color)),
];

/** An alias for `tetradic()` */
export const dualComplementary = tetradic;
#+END_SRC

***** square

+ =square: (color: string) => [string, string, string, string]=
+ =color: string=: the base color to generate from

#+BEGIN_SRC js :tangle "./color.js" :comments link
/**
 * Creates a square color scheme from any valid CSS color.
 *
 * @example Creating a square color scheme
 *
 * ```ts
 * square("coral");
 * ```
 *
 * @remarks
 * A square color scheme consists of four colors positioned equally
 * around the color wheel; 90 apart.
 *
 * @param {string} color - the base color to generate from
 * @returns {[string, string, string, string]} The base hues for a square color scheme
 */
export const square = (color) => [
  hue(0, color),
  hue(90, color),
  hue(180, color),
  hue(270, color),
];
#+END_SRC

***** custom

+ =custom: (attrs: { hues: number, arc: number, offset?: number }, color: string) => string[]=
+ =attrs: { hues: number, arc: number, offset?: number }=
  - =hues: number=: the number of total hues to generate (minus values that overlap)
  - =arc: number=: the desired arc distance between each hue on the wheel
  - =offset?: number=: an optional rotation offset for generated hues (does not change origin)
+ =color: string=: the base color to generate custom scheme

#+BEGIN_SRC js :tangle "./color.js" :comments link
function generate({ hues, arc, offset = 0 }, color) {
  const values = Array(offset ? hues - 1 : hues + 1).fill(arc);
  const half = Math.ceil(values.length / 2);
  const [leftOfOrigin, rightOfOrigin] = [
    values.slice(0, half),
    values.slice(half, values.length),
  ];
  return offset
    ? [
      ...new Set([
        hue(0, color),
        ...leftOfOrigin.map((v, i) => hue(-(v * i) - offset, color)),
        ...rightOfOrigin.map((v, i) => hue(v * i + offset, color)),
      ]),
    ] // Must preserve the origin with offset
    : [
      ...new Set([
        ...leftOfOrigin.map((v, i) => hue(-(v * i) - offset, color)),
        ...rightOfOrigin.map((v, i) => hue(v * i + offset, color)),
      ]),
    ]; // Must add an extra hue to generate from origin
}

/**
 * A function for creating advanced schemes from any valid CSS color.
 *
 * @example Creating a five tone color scheme
 *
 * ```ts
 * custom({ hues: 5, arc: 72 }, "#e33a00");
 * ```
 *
 * @example Creating a six tone color scheme
 *
 * ```ts
 * custom({ hues: 6, arc: 60 }, "hsl(320grad, 75%, 50%)");
 * ```
 * @example  Creating an accented split complementary
 *
 * ```ts
 * custom({ hues: 4, arc: 30, offset: 150 }, "royalblue");
 * ```
 *
 * @remarks
 * This function is for generating schemes beyond basic configuration.
 *
 * It allows setting any number of hues but will only generate unique colors.
 * The arc is the distance between each color on the wheel. The offset defines
 * degree of rotation for the generated hues from the origin.
 *
 * @param {{ hues: number, arc: number, offset?: number }} attrs - A configuration object defining desired hues (minus overlapping values), arc distance between each hue from the origin, and optional rotation offset
 * @param {string} color - the base color to generate scheme
 * @returns {string[]} A collection of base hues for a custom scheme
 */
export const custom = (attrs, color) => generate(attrs, color);
#+END_SRC

***** Tests

****** Color Scheme Generation Assertions

#+BEGIN_SRC js :tangle "./tests/color_scheme_test.js" :comments link
import {
  analogous,
  complementary,
  custom,
  dualComplementary,
  splitComplementary,
  square,
  tetradic,
  triadic,
} from "../color.js";

import {
  assertEquals,
  assertThrows,
} from "https://deno.land/std@0.86.0/testing/asserts.ts";

Deno.test(
  "SPEC complementary: generate base hues for complementary scheme",
  function () {
    assertEquals(complementary("red"), ["#ff0000", "#00a9db"]);
    assertEquals(complementary("lime"), ["#00ff00", "#ff7dff"]);
    assertEquals(complementary("blue"), ["#0000ff", "#a02000"]);
  },
);

Deno.test(
  "SPEC analogous: generate base hues for analogous scheme",
  function () {
    assertEquals(analogous("red"), ["#ff0000", "#f50084", "#ef4600"]);
    assertEquals(analogous("lime"), ["#00ff00", "#dbe100", "#00ffbe"]);
    assertEquals(analogous("blue"), ["#0000ff", "#0053e4", "#6e00ec"]);
  },
);

Deno.test(
  "SPEC splitComplementary: generate base hues for split complementary scheme",
  function () {
    assertEquals(splitComplementary("red"), ["#ff0000", "#649bec", "#00b2b8"]);
    assertEquals(splitComplementary("lime"), ["#00ff00", "#ff70b9", "#ca93ff"]);
    assertEquals(splitComplementary("blue"), ["#0000ff", "#943800", "#9c194e"]);
  },
);

Deno.test("SPEC triadic: generate base hues for triadic scheme", function () {
  assertEquals(triadic("red"), ["#ff0000", "#00ae00", "#4f6fff"]);
  assertEquals(triadic("cyan"), ["#00ffff", "#ffbfff", "#ffd05c"]);
});

Deno.test("SPEC tetradic: generate base hues for tetradic scheme", function () {
  assertEquals(tetradic("red"), ["#ff0000", "#c57500", "#00a9db", "#978be8"]);
  assertEquals(tetradic("lime"), ["#00ff00", "#00ffff", "#ff7dff", "#ff7366"]);
  assertEquals(tetradic("blue"), ["#0000ff", "#9e00b2", "#a02000", "#775100"]);
});

Deno.test("ALIAS dualComplementary of tetradic", function () {
  assertEquals(dualComplementary("cyan"), [
    "#00ffff",
    "#96e3ff",
    "#ffb3bf",
    "#f2c18b",
  ]);
});

Deno.test("SPEC square: generate base hues for square scheme", function () {
  assertEquals(square("red"), ["#ff0000", "#7b9900", "#00a9db", "#a34fff"]);
  assertEquals(square("lime"), ["#00ff00", "#00e9ff", "#ff7dff", "#ff8300"]);
  assertEquals(square("blue"), ["#0000ff", "#c00061", "#a02000", "#008048"]);
});

Deno.test("SPEC custom: simulate complementary", function () {
  assertEquals(custom({ hues: 2, arc: 180 }, "red"), ["#ff0000", "#00a9db"]);
});

Deno.test("SPEC custom: simulate analogous", function () {
  assertEquals(custom({ hues: 3, arc: 30 }, "red"), [
    "#ff0000",
    "#f50084",
    "#ef4600",
  ]);
});

Deno.test("SPEC custom: simulate triadic", function () {
  assertEquals(custom({ hues: 3, arc: 120 }, "red"), [
    "#ff0000",
    "#4f6fff",
    "#00ae00",
  ]);
});

Deno.test("SPEC custom: simulate square", function () {
  assertEquals(custom({ hues: 4, arc: 90 }, "red"), [
    "#ff0000",
    "#a34fff",
    "#00a9db",
    "#7b9900",
  ]);
});

Deno.test("SPEC custom: dyad", function () {
  assertEquals(custom({ hues: 2, arc: 60 }, "red"), ["#ff0000", "#d62fd2"]);
});

Deno.test("SPEC custom: extended analogous", function () {
  assertEquals(custom({ hues: 4, arc: 30 }, "red"), [
    "#ff0000",
    "#f50084",
    "#d62fd2",
    "#ef4600",
  ]);
});

Deno.test("SPEC custom: accented triad", function () {
  assertEquals(custom({ hues: 5, arc: 60, offset: 120 }, "red"), [
    "#ff0000",
    "#4f6fff",
    "#00a9db",
    "#00ae00",
  ]);
});

Deno.test("SPEC custom: accented split complementary", function () {
  assertEquals(custom({ hues: 4, arc: 30, offset: 150 }, "red"), [
    "#ff0000",
    "#0090ff",
    "#00a9db",
    "#00b48c",
  ]);
});

Deno.test("EDGE: rejects invalid color", function () {
  const fns = [
    complementary,
    analogous,
    splitComplementary,
    triadic,
    tetradic,
    square,
  ];

  fns.map((fn) =>
    assertThrows(
      () => {
        throw fn("invalid");
      },
      undefined,
      "not a valid CSS color",
    )
  );
  assertThrows(
    () => {
      throw custom({ hues: 2, arc: 180 }, "invalid");
    },
    undefined,
    "not a valid CSS color",
  );
});
#+END_SRC

****** Color Scheme Generation Results

#+BEGIN_SRC shell
printf '%s\n' (NO_COLOR=true deno test ./tests/color_scheme_test.js)
#+END_SRC

#+NAME: scheme-test
#+begin_src shell
running 16 tests
test SPEC complementary: generate base hues for complementary scheme ... ok (18ms)
test SPEC analogous: generate base hues for analogous scheme ... ok (6ms)
test SPEC splitComplementary: generate base hues for split complementary scheme ... ok (8ms)
test SPEC triadic: generate base hues for triadic scheme ... ok (4ms)
test SPEC tetradic: generate base hues for tetradic scheme ... ok (8ms)
test ALIAS dualComplementary of tetradic ... ok (4ms)
test SPEC square: generate base hues for square scheme ... ok (6ms)
test SPEC custom: simulate complementary ... ok (3ms)
test SPEC custom: simulate analogous ... ok (3ms)
test SPEC custom: simulate triadic ... ok (4ms)
test SPEC custom: simulate square ... ok (3ms)
test SPEC custom: dyad ... ok (2ms)
test SPEC custom: extended analogous ... ok (4ms)
test SPEC custom: accented triad ... ok (4ms)
test SPEC custom: accented split complementary ... ok (3ms)
test EDGE: rejects invalid color ... ok (4ms)

test result: ok. 16 passed; 0 failed; 0 ignored; 0 measured; 0 filtered out (86ms)

#+end_src

