README.org
***** sass

+ =sass: (dict: object) => string=
+ =dict: object=: the dictionary to process

#+BEGIN_SRC js :tangle "./design_tokens.js" :comments link
/**
 * Transforms Quark System Dictionaries into Sass variables.
 *
 * @example
 *
 * ```ts
 * sass(dict);
 * ```
 *
 * @remarks
 * This function does not actually write files as the core has no need
 * for read/write access.
 *
 * You'll want to use the native API or filesystem library of your choice in
 * your JavaScript environment to output the files.
 *
 * @param {object} dict - the dictionary data to process
 * @returns {string} The transformed dictionary as Sass variables (file-ready)
 */
export const sass = (dict) => construct({ prefix: "$" }, dict);
#+END_SRC

***** less

+ =less: (dict: object) => string=
+ =dict: object=: the dictionary to process

#+BEGIN_SRC js :tangle "./design_tokens.js" :comments link
/**
 * Transforms Quark System Dictionaries into Less variables.
 *
 * @example
 *
 * ```ts
 * less(dict);
 * ```
 *
 * @remarks
 * This function does not actually write files as the core has no need
 * for read/write access.
 *
 * You'll want to use the native API or filesystem library of your choice in
 * your JavaScript environment to output the files.
 *
 * @param {object} dict - the dictionary data to process
 * @returns {string} The transformed dictionary as Less variables (file-ready)
 */
export const less = (dict) => construct({ prefix: "@" }, dict);
#+END_SRC

***** styl

+ =styl: (dict: object) => string=
+ =dict: object=: the dictionary to process

#+BEGIN_SRC js :tangle "./design_tokens.js" :comments link
/**
 * Transforms Quark System Dictionaries into Stylus variables.
 *
 * @example
 *
 * ```ts
 * styl(dict);
 * ```
 *
 * @remarks
 * This function does not actually write files as the core has no need
 * for read/write access.
 *
 * You'll want to use the native API or filesystem library of your choice in
 * your JavaScript environment to output the files.
 *
 * @param {object} dict - the dictionary data to process
 * @returns {string} The transformed dictionary as Stylus variables (file-ready)
 */
export const styl = (dict) =>
  construct({ prefix: "", operator: " = ", suffix: "" }, dict);
#+END_SRC

***** Tests

****** CSS Format Assertions

#+BEGIN_SRC js :tangle "./tests/output_css_test.js" :comments link
import { css, less, sass, styl } from "../design_tokens.js";
import { clrs } from "../color.js";
import { triadic } from "../color.js";
import { shades, tints } from "../color.js";

import { assertStrictEquals } from "https://deno.land/std@0.86.0/testing/asserts.ts";

const swatch = clrs("red");
const [main, accent, highlight] = triadic(swatch);
const light = tints.bind(null, 3, 99);
const dark = shades.bind(null, 2, 99);

const dict = {
  color: {
    main: {
      base: main,
      light: light(main),
      dark: dark(main),
    },
    accent: {
      base: accent,
      dark: dark(accent),
    },
    highlight,
  },
};

Deno.test(
  "SPEC css: can process dictionary into CSS custom properties",
  function () {
    assertStrictEquals(
      css(dict),
      `
:root {
  --color-main: #ff4036;
  --color-main-light-0: #ff9d99;
  --color-main-light-1: #ffd3d2;
  --color-main-light-2: #fffefe;
  --color-main-dark-0: #b42d26;
  --color-main-dark-1: #1a0605;
  --color-accent: #4036ff;
  --color-accent-dark-0: #2d26b4;
  --color-accent-dark-1: #06051a;
  --color-highlight: #36ff40;
}`,
    );
  },
);

Deno.test(
  "SPEC sass: can process dictionary into Sass variables",
  function () {
    assertStrictEquals(
      sass(dict),
      `
$color-main: #ff4036;
$color-main-light-0: #ff9d99;
$color-main-light-1: #ffd3d2;
$color-main-light-2: #fffefe;
$color-main-dark-0: #b42d26;
$color-main-dark-1: #1a0605;
$color-accent: #4036ff;
$color-accent-dark-0: #2d26b4;
$color-accent-dark-1: #06051a;
$color-highlight: #36ff40;
`,
    );
  },
);

Deno.test(
  "SPEC less: can process dictionary into Less variables",
  function () {
    assertStrictEquals(
      less(dict),
      `
@color-main: #ff4036;
@color-main-light-0: #ff9d99;
@color-main-light-1: #ffd3d2;
@color-main-light-2: #fffefe;
@color-main-dark-0: #b42d26;
@color-main-dark-1: #1a0605;
@color-accent: #4036ff;
@color-accent-dark-0: #2d26b4;
@color-accent-dark-1: #06051a;
@color-highlight: #36ff40;
`,
    );
  },
);

Deno.test(
  "SPEC styl: can process dictionary into Stylus variables",
  function () {
    assertStrictEquals(
      styl(dict),
      `
color-main = #ff4036
color-main-light-0 = #ff9d99
color-main-light-1 = #ffd3d2
color-main-light-2 = #fffefe
color-main-dark-0 = #b42d26
color-main-dark-1 = #1a0605
color-accent = #4036ff
color-accent-dark-0 = #2d26b4
color-accent-dark-1 = #06051a
color-highlight = #36ff40
`,
    );
  },
);
#+END_SRC

****** CSS Format Results

#+BEGIN_SRC shell
printf '%s\n' (NO_COLOR=true deno test ./tests/output_css_test.js)
#+END_SRC

#+NAME: css-test
#+begin_src shell
running 4 tests
test SPEC css: can process dictionary into CSS custom properties ... ok (5ms)
test SPEC sass: can process dictionary into Sass variables ... ok (2ms)
test SPEC less: can process dictionary into Less variables ... ok (2ms)
test SPEC styl: can process dictionary into Stylus variables ... ok (2ms)

test result: ok. 4 passed; 0 failed; 0 ignored; 0 measured; 0 filtered out (12ms)

#+end_src

**** Data Export (=design_tokens.js=)

Quarks System Core also supports exporting tokens in general data formats (raw JSON and YAML
supported as of this writing). This allows complete detachment from the core and the portability to
use system data outside of JavaScript environments.

***** raw

+ =raw: (dict: object) => object=
+ =dict: object=: the dictionary to process

#+BEGIN_SRC js :tangle "./design_tokens.js" :comments link
/**
 * Transforms Quark System Dictionaries into raw JSON data.
 *
 * @example
 *
 * ```ts
 * raw(dict);
 * ```
 *
 * @remarks
 * This function does not actually write files as the core has no need
 * for read/write access.
 *
 * You'll want to use the native API or filesystem library of your choice in
 * your JavaScript environment to output the files.
 *
 * @param {object} dict - the dictionary data to process
 * @returns {string} The transformed dictionary as raw JSON data (file-ready)
 */
export const raw = (dict) => JSON.stringify(dict, null, 2);
#+END_SRC

