export_data.js
// [[file:README.org::*raw][raw:1]]
/**
 * Transforms Quark System Dictionaries into raw JSON data.
 *
 * @example
 *
 * ```ts
 * raw(dict);
 * ```
 *
 * @remarks
 * This function does not actually write files as the core has no need
 * for read/write access.
 *
 * You'll want to use the native API or filesystem library of your choice in
 * your JavaScript environment to output the files.
 *
 * @param {object} dict - the dictionary data to process
 * @returns {string} The transformed dictionary as raw JSON data (file-ready)
 */
export const raw = (dict) => JSON.stringify(dict, null, 2);
// raw:1 ends here
