README.org
***** yaml

+ =yaml: (dict: object) => string=
+ =dict: object=: the dictionary to process

YAML is a whitespace-dependent data format, so I kept that in mind when constructing the helper
bits. The way it works: specific data builders execute when the function encounters the right kind
of data.

And then the main function recursively walks through the dictionary to completion.

#+BEGIN_SRC js :tangle "./design_tokens.js" :comments link
const whitespace = 2;

const value = (level, str, key, value) =>
  str.concat("".padStart(level), key, ": ", value, "\n");

const scale = (level, str, key, value) =>
  str.concat(
    "".padStart(level),
    key,
    ":\n",
    value.reduce(
      (s, v) => s.concat("".padStart(level + whitespace), "- ", v, "\n"),
      "",
    ),
  );

const subcategory = (level, data) =>
  Object.entries(data).reduce((str, [key, v]) => {
    if (Array.isArray(v)) return scale(level, str, key, v);
    return value(level, str, key, v);
  }, "");

const assemble = (level, tree) =>
  Object.entries(tree).reduce((str, [key, data]) => {
    if (typeof data === "string") return value(level, str, key, data);
    if (Array.isArray(data)) return scale(level, str, key, data);
    if (key === "base") return subcategory(level, data);
    return str.concat(
      "".padStart(level),
      key,
      ":\n",
      assemble(level + whitespace, data),
    );
  }, "");

/**
 * Transforms Quark System Dictionaries into YAML data.
 *
 * @example
 *
 * ```ts
 * yaml(dict);
 * ```
 *
 * @remarks
 * This function does not actually write files as the core has no need
 * for read/write access.
 *
 * You'll want to use the native API or filesystem library of your choice in
 * your JavaScript environment to output the files.
 *
 * @param {object} dict - the dictionary data to process
 * @returns {string} The transformed dictionary as yaml data (file-ready)
 */
export const yaml = (dict) =>
  Object.entries(dict)
    .reduce((str, [key, data]) => {
      if (typeof data === "string") return value(0, str, key, data);
      if (Array.isArray(data)) return scale(0, str, key, data);
      if (key === "base") return subcategory(0, data);
      return str.concat("\n", key, ":\n", assemble(whitespace, data));
    }, "")
    .trimEnd();
#+END_SRC

***** Tests

****** Data Export Assertions

#+BEGIN_SRC js :tangle "./tests/export_data_test.js" :comments link
import { raw, yaml } from "../design_tokens.js";
import { clrs } from "../color.js";
import { triadic } from "../color.js";
import { shades, tints } from "../color.js";

import { assertStrictEquals } from "https://deno.land/std@0.86.0/testing/asserts.ts";

const swatch = clrs("red");
const [main, accent, highlight] = triadic(swatch);
const light = tints.bind(null, 3, 99);
const dark = shades.bind(null, 2, 99);

const dict = {
  color: {
    main: {
      base: main,
      light: light(main),
      dark: dark(main),
    },
    accent: {
      base: accent,
      dark: dark(accent),
    },
    highlight,
  },
};

Deno.test(
  "SPEC raw: exports dictionary data as raw JSON",
  function () {
    assertStrictEquals(
      raw(dict),
      `{
  "color": {
    "main": {
      "base": "#ff4036",
      "light": [
        "#ff9d99",
        "#ffd3d2",
        "#fffefe"
      ],
      "dark": [
        "#b42d26",
        "#1a0605"
      ]
    },
    "accent": {
      "base": "#4036ff",
      "dark": [
        "#2d26b4",
        "#06051a"
      ]
    },
    "highlight": "#36ff40"
  }
}`,
    );
  },
);

Deno.test(
  "SPEC yaml: exports dictionary data as YAML",
  function () {
    assertStrictEquals(
      yaml(dict),
      `
color:
  main:
    base: #ff4036
    light:
      - #ff9d99
      - #ffd3d2
      - #fffefe
    dark:
      - #b42d26
      - #1a0605
  accent:
    base: #4036ff
    dark:
      - #2d26b4
      - #06051a
  highlight: #36ff40`,
    );
  },
);
#+END_SRC

****** Data Export Results

#+BEGIN_SRC shell
printf '%s\n' (NO_COLOR=true deno test ./tests/export_data_test.js)
#+END_SRC

#+NAME: export-test
#+begin_src shell
running 2 tests
test SPEC raw: transforms a dictionary into its raw JSON data ... ok (3ms)
test SPEC yaml: transforms a dictionary to YAML formatted data ... ok (2ms)

test result: ok. 2 passed; 0 failed; 0 ignored; 0 measured; 0 filtered out (6ms)

#+end_src

**** Data Transforms (=design_tokens.js=)

The final set of token formats are reserved for integrating with other tools that use and transform
design data. Currently, it supports tools that I use regularly in my own projects (TailwindCSS and
Style Dictionary), but more will be added as the project grows.

***** tailwind

+ =tailwind: (dict: object) => string=
+ =dict: object=: the dictionary to process

#+BEGIN_SRC js :tangle "./design_tokens.js" :comments link
/**
 * Reformats Quark System Dictionaries as TailwindCSS theme data.
 *
 * @example
 *
 * ```ts
 * tailwind(dict);
 * ```
 *
 * @param {object} dict - the dictionary data to process
 * @returns {string} The transformed dictionary as TailwindCSS theme data (file-ready)
 */
export const tailwind = (dict) =>
  Object.entries(dict).reduce((acc, [key, data]) => {
    if (key === "base") return { ...acc, DEFAULT: data };
    if (Array.isArray(data)) {
      return {
        ...acc,
        ...{
          ...data.reduce((a, v, i) => {
            return { ...a, [[key, i + 2].join("")]: v };
          }, {}),
        },
      };
    }
    if (typeof data === "object") return { ...acc, [key]: tailwind(data) };
    return { ...acc, [key]: data };
  }, {});
#+END_SRC

***** styledict

+ =styledict: (dict: object) => string=
+ =dict: object=: the dictionary to process

#+BEGIN_SRC js :tangle "./design_tokens.js" :comments link
/**
 * Reformats Quark System Dictionaries as Style Dictionary properties.
 *
 * @example
 *
 * ```ts
 * styledict(dict);
 * ```
 *
 * @remarks
 * This function does not actually write files as the core has no need
 * for read/write access.
 *
 * You'll want to use the native API or filesystem library of your choice in
 * your JavaScript environment to output the files.
 *
 * @param {object} dict - the dictionary data to process
 * @returns {string} The transformed dictionary as Style Dictionary properties (file-ready)
 */
export const styledict = (dict) =>
  Object.entries(dict).reduce((acc, [key, data]) => {
    if (typeof data === "object") {
      return { ...acc, [key]: styledict(data) };
    }
    return { ...acc, [key]: { value: String(data) } };
  }, {});
#+END_SRC

***** Tests

****** Data Transform Assertions

#+BEGIN_SRC js :tangle "./tests/transform_data_test.js" :comments link
import { styledict, tailwind } from "../design_tokens.js";
import { clrs } from "../color.js";
import { triadic } from "../color.js";
import { shades, tints } from "../color.js";

import { assertEquals } from "https://deno.land/std@0.86.0/testing/asserts.ts";

const swatch = clrs("red");
const [main, accent, highlight] = triadic(swatch);
const light = tints.bind(null, 3, 99);
const dark = shades.bind(null, 2, 99);

const dict = {
  color: {
    main: {
      base: main,
      light: light(main)[0],
      lighter: light(main)[1],
      lightest: light(main)[2],
      dark: dark(main)[0],
      darker: dark(main)[1],
    },
    accent: {
      base: accent,
      dark: dark(accent)[0],
      darker: dark(accent)[1],
    },
    highlight,
  },
};

Deno.test(
  "SPEC tailwind: transforms dictionary data into TailwindCSS theme",
  function () {
    assertEquals(tailwind(dict), {
      color: {
        main: {
          DEFAULT: "#ff4036",
          light: "#ff9d99",
          lighter: "#ffd3d2",
          lightest: "#fffefe",
          dark: "#b42d26",
          darker: "#1a0605",
        },
        accent: { DEFAULT: "#4036ff", dark: "#2d26b4", darker: "#06051a" },
        highlight: "#36ff40",
      },
    });
  },
);

Deno.test(
  "SPEC styledict: transforms dictionary data into Style Dictionary properties",
  function () {
    assertEquals(styledict(dict), {
      color: {
        main: {
          base: {
            value: "#ff4036",
          },
          dark: {
            value: "#b42d26",
          },
          darker: {
            value: "#1a0605",
          },
          light: {
            value: "#ff9d99",
          },
          lighter: {
            value: "#ffd3d2",
          },
          lightest: {
            value: "#fffefe",
          },
        },
        accent: {
          base: {
            value: "#4036ff",
          },
          dark: {
            value: "#2d26b4",
          },
          darker: {
            value: "#06051a",
          },
        },
        highlight: {
          value: "#36ff40",
        },
      },
    });
  },
);
#+END_SRC

