README.org
****** Data Transform Results

#+BEGIN_SRC shell
printf '%s\n' (NO_COLOR=true deno test ./tests/data_transform_test.js)
#+END_SRC

#+NAME: transform-test
#+begin_src shell
running 2 tests
test SPEC tailwind: can reformat a dictionary as Tailwind theme data ... ok (6ms)
test SPEC styledict: can reformat a dictionary as Style Dictionary properties ... ok (13ms)

test result: ok. 2 passed; 0 failed; 0 ignored; 0 measured; 0 filtered out (19ms)

#+end_src

** Internals

This section documents and implements useful internal functions that aid in developing the core
itself. They are not publicly accessible. The only reason you'd want to read this section is if
you're interested in the nuts and bolts of this project.

*** Error Handling (=internals/error.js=)

#+BEGIN_SRC js :tangle "./internals/error.js" :comments link
/** Error message template */
export function ErrorTemplate(
  { message, reason, suggestion, output } = {
    message: "something went wrong",
    reason: "here's why",
    suggestion: "try this",
    output: undefined,
  },
) {
  throw new Error(`
ERROR: ${message.trimEnd()}
${"=".repeat(60)}
REASON: ${reason.trimEnd()}
TRY: ${suggestion.trimEnd()}
${"-".repeat(60)}
OUTPUT: ${output};
`);
}
#+END_SRC

I believe in the power of good error messages in helping developers solve their own problems. Human-readable errors also decrease the likelihood that you'll need to consult documentation during your workflow.

The format of error messages thrown by the core is straightforward.

#+BEGIN_SRC text
ERROR: something went wrong
============================================================
REASON: here's why
TRY: troubleshooting suggestions
------------------------------------------------------------
OUTPUT: "and what actually happened";
#+END_SRC

*** Color
**** Supported Formats (=internals/color/formats.js=)

QuarkSuite is designed primarily for web technologies and handles all current (and upcoming) CSS color
formats. This section documents how the QSC validates colors and extracts color values.

It also includes a pseudo-implementation of a non-standard format for special purposes: Oklab.

***** Syntax Tokens

I recently refactored the validation logic through identifying the common tokens across CSS color
formats. So, I captured these repeating patterns as constants.

#+BEGIN_SRC js :tangle "./internals/color/formats.js" :comments link
// channel: float<0-100>% || int<0-255>
const CHANNEL_TOK =
  /(?:(?:100%|(?:\d\.?\d?){1,}%)|(?:25[0-5]|24[0-4][0-9]|1[0-9]{2}|\d{1,}|0))/;

// hue: -?float<0->deg? || -?float<0->rad || -?float<0->grad || -?float<0->turn
const HUE_TOK = /(?:-?(?:(?:\d\.?\d?)(?:deg|g?rad|turn)?)+)/;

// percentage: float<0-100>%
const PERCENT_TOK = /(?:(?:100%|(?:\d\.?\d?){1,}%))/;

// percentage: float<0->%
const CIE_LUM_TOK = /(?:(?:\d\.?\d?){1,}%)/;

// hue: -?<0-128>
const HUE_TOK_CIELAB = /(?:-?(?:128|(?:1[0-2][0-8]|(?:\d.?\d?){1,})))/;

// chroma: int<0-230>
const CHROMA_TOK = /(?:(?:230|(?:2[0-2][0-9]|1[0-9][0-9])|(?:\d.?\d?){1,}))/;

// transparency: float<0-1> || float<0-100>%
const PERCENT_TOK_DECIMAL = /(?:(?:0|0\.\d+|1)|(?:100|(?:\d\.?\d?){1,}%))/;

// chroma: -?float<0-0.5>
const CHROMA_TOK_OKLAB = /(?:-?(?:0|0\.\d+|0.5))/;

// separators: ", " || " " || " /"
const DELIM = /(?:[\s,]+)/;
const ALPHA_DELIM = /(?:[\s,/]+)/;
const DELIM_CSS4 = /(?:[\s]+)/;
const ALPHA_DELIM_CSS4 = /(?:[\s/]+)/;
#+END_SRC

After that, I wrote a function to assemble these tokens into their valid color formats. The =RegExp=
object includes a property of =source= that allows regular expressions to be concatenated and
assigned to constants. This results in much more readable and configurable pattern matching
possibilities.

#+BEGIN_SRC js :tangle "./internals/color/formats.js" :comments link
function matchFunctionalFormat({ prefix, legacy = true }, tokens) {
  const tokenValues = tokens.map((tok) => tok.source);
  const ALPHA_TOK = PERCENT_TOK_DECIMAL;

  const DELIMITER = legacy ? DELIM : DELIM_CSS4;
  const ALPHA_DELIMITER = legacy ? ALPHA_DELIM : ALPHA_DELIM_CSS4;
  return new RegExp(
    `(?:^${prefix}\\(`.concat(
      tokenValues.join(DELIMITER.source),
      `(?:${[ALPHA_DELIMITER.source, ALPHA_TOK.source].join("")})?\\))`,
    ),
  );
}
#+END_SRC

***** Value Extractors

During the recent refactor, I also realized that having extractors for every single functional color
format was overkill as they expect many of the same tokens. =hexExtractor= stands alone for its
special purpose while =valueExtractor= handles every other format.

#+BEGIN_SRC js :tangle "./internals/color/formats.js" :comments link
/** Extract RGB Hex values */
export const hexExtractor = (color) => expandHex(color).match(/[\da-f]{2}/g);

/** Extract functional color format components */
export const valueExtractor = (color) =>
  color.match(/(-?[\d.](%|deg|g?rad|turn)?)+/g);
#+END_SRC

***** RGB Hex

In Quarks System Core, hex colors are treated as a universal color format. In all likelihood, if
software operates with color, it renders this format. So RGB Hex can be a reliable fallback when
nothing else works.

#+NAME: hex-samples
| Color   | Value     |
|---------+-----------|
| Black   | =#000000=   |
| Gray    | =#808080=   |
| White   | =#ffffff=   |
| Red     | =#ff0000=   |
| Yellow  | =#ffff00=   |
| Green   | =#00ff00=   |
| Cyan    | =#00ffff=   |
| Blue    | =#0000ff=   |
| Magenta | =#ff00ff=   |
| Etc.    | =#ace=      |
|         | =#bea=      |
|         | =#fed=      |
|         | =#face=     |
|         | =#cafe=     |
|         | =#deaded=   |
|         | =#c0ffee=   |
|         | =#4991ccaa= |
|         | =#abcdef68=  |

****** Hex Validator

The regular expression to validate a hex color is short.

#+BEGIN_SRC js :tangle "./internals/color/formats.js" :comments link
/** Validate: hex color */
const hexValidator = (color) => /^#([\da-f]{3,4}){1,2}$/i.test(color);
#+END_SRC

Let's see if all the colors defined in the table pass.

#+BEGIN_SRC js :results output code replace :allow read :var hexTable=hex-samples
const { hexValidator } = await import(`${Deno.cwd()}/internals/color/formats.js`);
const colors = hexTable.map(([a, b]) => b.replace(/=/g, ""));

console.log("const colors =", colors.filter((color) => hexValidator(color)))
#+END_SRC

#+NAME: valid-hex
#+begin_src js
const colors = [
  "#000000",   "#808080",
  "#ffffff",   "#ff0000",
  "#ffff00",   "#00ff00",
  "#00ffff",   "#0000ff",
  "#ff00ff",   "#ace",
  "#bea",      "#fed",
  "#face",     "#cafe",
  "#deaded",   "#c0ffee",
  "#4991ccaa", "#abcdef68"
]
#+end_src

****** Hex Value Extraction

Now, that I know I have valid hex colors, I need to be able to extract their RGB(A) channels.

The first step is enforcing uniformity. To prevent any surprises, I'm going to simply expand hex
color shorthand =#RGB(A)= to a full hex color =#RRGGBB(AA)=.

#+BEGIN_SRC js :tangle "./internals/color/formats.js" :comments link
/** Expand hex shorthand into full hex color */
function expandHex(color) {
  const [, ...values] = color;

  if (values.length === 3 || values.length === 4) {
    return `#${values.map((channel) => channel.repeat(2)).join("")}`;
  }

  return color;
}
#+END_SRC

Having secured uniform input, I'm ready to extract the channel values for processing.

#+BEGIN_SRC js :results output code replace :allow read :noweb yes
const { hexExtractor } = await import (`${Deno.cwd()}/internals/color/formats.js`);

<<valid-hex>>

console.log("const colors =", colors.map((color) => ({color, values: hexExtractor(color)})));
#+END_SRC

#+NAME: hex-values
#+begin_src js
const colors = [
  { color: "#000000", values: [ "00", "00", "00" ] },
  { color: "#808080", values: [ "80", "80", "80" ] },
  { color: "#ffffff", values: [ "ff", "ff", "ff" ] },
  { color: "#ff0000", values: [ "ff", "00", "00" ] },
  { color: "#ffff00", values: [ "ff", "ff", "00" ] },
  { color: "#00ff00", values: [ "00", "ff", "00" ] },
  { color: "#00ffff", values: [ "00", "ff", "ff" ] },
  { color: "#0000ff", values: [ "00", "00", "ff" ] },
  { color: "#ff00ff", values: [ "ff", "00", "ff" ] },
  { color: "#ace", values: [ "aa", "cc", "ee" ] },
  { color: "#bea", values: [ "bb", "ee", "aa" ] },
  { color: "#fed", values: [ "ff", "ee", "dd" ] },
  { color: "#face", values: [ "ff", "aa", "cc", "ee" ] },
  { color: "#cafe", values: [ "cc", "aa", "ff", "ee" ] },
  { color: "#deaded", values: [ "de", "ad", "ed" ] },
  { color: "#c0ffee", values: [ "c0", "ff", "ee" ] },
  { color: "#4991ccaa", values: [ "49", "91", "cc", "aa" ] },
  { color: "#abcdef68", values: [ "ab", "cd", "ef", "68" ] }
]
#+end_src

***** Named Colors

Named colors are simple to validate. It's a matter of matching the name with its hex value in the
=X11Colors= lookup table as a boolean.

#+BEGIN_SRC js :tangle "./internals/color/formats.js" :comments link
import { X11Colors } from "../../data/color/w3c-x11.js";

/** Validate: W3C X11 named colors */
const namedValidator = (color) => !!X11Colors[color];
#+END_SRC

***** Functional RGB

Functional RGB is the second most common color format used on the web. It's a great option for if
you need a more human readable format with solid browser support.

#+NAME: rgb-samples
| Color   | Value                    |
|---------+--------------------------|
| Black   | =rgb(0, 0, 0)=             |
| Gray    | =rgb(128, 128, 128)=       |
| White   | =rgb(255, 255, 255)=       |
| Red     | =rgb(255, 0, 0)=           |
| Yellow  | =rgb(255, 255, 0)=         |
| Green   | =rgb(0, 255, 0)=           |
| Cyan    | =rgb(0, 255, 255)=         |
| Blue    | =rgb(0, 0, 255)=           |
| Magenta | =rgb(255, 0, 255)=         |
| Etc.    | =rgb(33, 199, 95)=         |
|         | =rgb(19, 114, 220)=        |
|         | =rgb(10%, 40.4%, 49.9%)=   |
|         | =rgb(200 138 39)=          |
|         | =rgb(31 88 49 / 0.8)=      |
|         | =rgba(110, 33, 110, 0.75)= |
|         | =rgba(10, 119, 30, 30%)=   |

****** RGB Validator

Since all supported color formats beyond RGB Hex are functional, I'm gonna used that
=matchFunctionalFormat= helper I whipped up to fill an array with three =CHANNEL_TOK= and then test
it against the input color. If it matches, it returns the color for further processing.

#+BEGIN_SRC js :tangle "./internals/color/formats.js" :comments link
/** Validate: functional RGB format */
const rgbValidator = (color) =>
  matchFunctionalFormat({ prefix: "rgba?" }, Array(3).fill(CHANNEL_TOK)).test(
    color,
  );
#+END_SRC

For now I'll check my table of colors.

#+BEGIN_SRC js :results output code replace :allow read :var rgbTable=rgb-samples
const { rgbValidator } = await import(`${Deno.cwd()}/internals/color/formats.js`);
const colors = rgbTable.map(([a, b]) => b.replace(/=/g, ""));

console.log("const colors =", colors.filter((color) => rgbValidator(color)))
#+END_SRC

#+NAME: valid-rgb
#+begin_src js
const colors = [
  "rgb(0, 0, 0)",
  "rgb(128, 128, 128)",
  "rgb(255, 255, 255)",
  "rgb(255, 0, 0)",
  "rgb(255, 255, 0)",
  "rgb(0, 255, 0)",
  "rgb(0, 255, 255)",
  "rgb(0, 0, 255)",
  "rgb(255, 0, 255)",
  "rgb(33, 199, 95)",
  "rgb(19, 114, 220)",
  "rgb(10%, 40.4%, 49.9%)",
  "rgb(200 138 39)",
  "rgb(31 88 49 / 0.8)",
  "rgba(110, 33, 110, 0.75)",
  "rgba(10, 119, 30, 30%)"
]
#+end_src

All clear!

****** RGB Value Extraction

Since, I've now implemented a universal functional format value extractor the only thing to do here
is test that it really does extract my values.

#+BEGIN_SRC js :results output code replace :allow read :noweb yes
const { valueExtractor } = await import(`${Deno.cwd()}/internals/color/formats.js`);

<<valid-rgb>>

console.log("const colors =", colors.map((color) => ({ color, values: valueExtractor(color) })));
#+END_SRC

#+NAME: rgb-values
#+begin_src js
const colors = [
  { color: "rgb(0, 0, 0)", values: [ "0", "0", "0" ] },
  { color: "rgb(128, 128, 128)", values: [ "128", "128", "128" ] },
  { color: "rgb(255, 255, 255)", values: [ "255", "255", "255" ] },
  { color: "rgb(255, 0, 0)", values: [ "255", "0", "0" ] },
  { color: "rgb(255, 255, 0)", values: [ "255", "255", "0" ] },
  { color: "rgb(0, 255, 0)", values: [ "0", "255", "0" ] },
  { color: "rgb(0, 255, 255)", values: [ "0", "255", "255" ] },
  { color: "rgb(0, 0, 255)", values: [ "0", "0", "255" ] },
  { color: "rgb(255, 0, 255)", values: [ "255", "0", "255" ] },
  { color: "rgb(33, 199, 95)", values: [ "33", "199", "95" ] },
  { color: "rgb(19, 114, 220)", values: [ "19", "114", "220" ] },
  { color: "rgb(10%, 40.4%, 49.9%)", values: [ "10%", "40.4%", "49.9%" ] },
  { color: "rgb(200 138 39)", values: [ "200", "138", "39" ] },
  { color: "rgb(31 88 49 / 0.8)", values: [ "31", "88", "49", "0.8" ] },
  { color: "rgba(110, 33, 110, 0.75)", values: [ "110", "33", "110", "0.75" ] },
  { color: "rgba(10, 119, 30, 30%)", values: [ "10", "119", "30", "30%" ] }
]
#+end_src

