internals/color/formats.js

// [[file:../../README.org::*HSL Validator][HSL Validator:1]]
/** Validate: functional HSL format */
export const hslValidator = (color) =>
  matchFunctionalFormat({ prefix: "hsla?" }, [
    HUE_TOK,
    ...Array(2).fill(PERCENT_TOK),
  ]).test(color);
// HSL Validator:1 ends here

// [[file:../../README.org::*CMYK Validator][CMYK Validator:1]]
/** Validate: CMYK format */
export const cmykValidator = (color) =>
  matchFunctionalFormat(
    { prefix: "device-cmyk", legacy: false },
    Array(4).fill(PERCENT_TOK_DECIMAL)
  ).test(color);
// CMYK Validator:1 ends here

// [[file:../../README.org::*HWB Validator][HWB Validator:1]]
/** Validate: functional HWB format */
export function hwbValidator(color) {
  return matchFunctionalFormat({ prefix: "hwb", legacy: false }, [
    HUE_TOK,
    ...Array(2).fill(PERCENT_TOK),
  ]).test(color);
}
// HWB Validator:1 ends here
