README.org
****** CIELAB Validator

The CIELAB validator consists of =CIE_LUM_TOK= and =HUE_TOK_CIELAB= filling out the rest of the components.

#+BEGIN_SRC js :tangle "./internals/color/formats.js" :comments link
/** Validate: functional CIELAB format */
export function cielabValidator(color) {
  return matchFunctionalFormat({ prefix: "lab", legacy: false }, [
    CIE_LUM_TOK,
    ...Array(2).fill(HUE_TOK_CIELAB),
  ]).test(color);
}
#+END_SRC

Now, it's validator testing time.

#+BEGIN_SRC js :results output code replace :allow read :var cielabTable=cielab-samples
const { cielabValidator } = await import(`${Deno.cwd()}/internals/color/formats.js`);
const colors = cielabTable.map(([a, b]) => b.replace(/=/g, ""));

console.log("const colors =", colors.filter((color) => cielabValidator(color)))
#+END_SRC

#+NAME: valid-cielab
#+begin_src js
const colors = [
  "lab(0% 0 0)",
  "lab(53.59% 0 0)",
  "lab(100% 0 0)",
  "lab(54.29% 80.81 69.89)",
  "lab(97.6% -15.75 93.39)",
  "lab(87.82% -79.29 80.99)",
  "lab(90.67% -50.67 -14.96)",
  "lab(29.57% 68.3 -112.03)",
  "lab(60.17% 93.55 -60.5)",
  "lab(49.18% 38.1 -110.33)",
  "lab(91.3% -93 14)",
  "lab(83.119% 49.34 -3.99 / 0.75)",
  "lab(199% 38 13 / 78%)"
]
#+end_src

Good to go.

****** CIELAB Value Extraction

Calling upon my trusty universal extractor once again.

#+BEGIN_SRC js :results output code replace :allow read :noweb yes
const { valueExtractor } = await import(`${Deno.cwd()}/internals/color/formats.js`);

<<valid-lab>>

console.log("const colors =", colors.map((color) => ({ color, values: valueExtractor(color) })));
#+END_SRC

#+NAME: lab-values
#+begin_src js
const colors = [
  { color: "lab(0% 0 0)", values: [ "0%", "0", "0" ] },
  { color: "lab(53.59% 0 0)", values: [ "53.59%", "0", "0" ] },
  { color: "lab(100% 0 0)", values: [ "100%", "0", "0" ] },
  { color: "lab(54.29% 80.81 69.89)", values: [ "54.29%", "80.81", "69.89" ] },
  { color: "lab(97.6% -15.75 93.39)", values: [ "97.6%", "-15.75", "93.39" ] },
  { color: "lab(87.82% -79.29 80.99)", values: [ "87.82%", "-79.29", "80.99" ] },
  { color: "lab(90.67% -50.67 -14.96)", values: [ "90.67%", "-50.67", "-14.96" ] },
  { color: "lab(29.57% 68.3 -112.03)", values: [ "29.57%", "68.3", "-112.03" ] },
  { color: "lab(60.17% 93.55 -60.5)", values: [ "60.17%", "93.55", "-60.5" ] },
  { color: "lab(49.18% 38.1 -110.33)", values: [ "49.18%", "38.1", "-110.33" ] },
  { color: "lab(91.3% -93 14)", values: [ "91.3%", "-93", "14" ] },
  {
    color: "lab(83.119% 49.34 -3.99 / 0.75)",
    values: [ "83.119%", "49.34", "-3.99", "0.75" ]
  },
  { color: "lab(199% 38 13 / 78%)", values: [ "199%", "38", "13", "78%" ] }
]
#+end_src

***** Functional CIELCh(ab)

The CIELCh(ab) color space is another device-independent color format with added support in the CSS
Color Module Level 4 spec. It's CIELAB converted directly to polar coordinates. It consists of:

+ Lightness (L): a percentage value interpreted identically to CIELAB lightness
+ Chroma (C): a value corresponding to the amount of color desired
+ Hue (h): interpreted similar to HSL, but the angles map to the *a/*b axes

The chroma is theoretically boundless, but in everyday use caps at =230=. The hues at =0deg= and =180deg=
map to magenta-red and green-cyan, respectively. The hues at =90deg= and =270deg= map to a mustard
yellow and sky blue, respectively.

#+NAME: cielch-samples
| Color   | Value                              |
|---------+------------------------------------|
| Black   | =lch(0% 0 0)=                        |
| Gray    | =lch(53.59% 0 0)=                    |
| White   | =lch(100% 0 0)=                      |
| Red     | =lch(54.29% 106.84 40.855)=          |
| Yellow  | =lch(97.6% 94.709 99.573)=           |
| Green   | =lch(87.82% 113.34 134.39)=          |
| Cyan    | =lch(90.67% 52.832 196.45)=          |
| Blue    | =lch(29.57% 131.21 301.369)=         |
| Magenta | =lch(60.17% 111.41 327.109)=         |
| Etc.    | =lch(53.31% 89.31 200)=              |
|         | =lch(89.1% 167.34 3.6rad / 0.99)=    |
|         | =lch(24.494% 74.9 193grad)=          |
|         | =lch(47.39% 111.193 0.62turn / 75%)= |

****** CIELCh(ab) Validator

The CIELCh(ab) validator maps a =CIE_LUM_TOK=, a =CHROMA_TOK=, and a =HUE_TOK=.

#+BEGIN_SRC js :tangle "./internals/color/formats.js" :comments link
/** Validate: functional CIELCh(ab) format */
function cielchValidator(color) {
  return matchFunctionalFormat({ prefix: "lch", legacy: false }, [
    CIE_LUM_TOK,
    CHROMA_TOK,
    HUE_TOK,
  ]).test(color);
}
#+END_SRC

And when I test the color table:

#+BEGIN_SRC js :results output code replace :allow read :var cielchTable=cielch-samples
const { cielchValidator } = await import(`${Deno.cwd()}/internals/color/formats.js`);
const colors = cielchTable.map(([a, b]) => b.replace(/=/g, ""));

console.log("const colors =", colors.filter((color) => cielchValidator(color)))
#+END_SRC

#+NAME: valid-cielch
#+begin_src js
const colors = [
  "lch(0% 0 0)",
  "lch(53.59% 0 0)",
  "lch(100% 0 0)",
  "lch(54.29% 106.84 40.855)",
  "lch(97.6% 94.709 99.573)",
  "lch(87.82% 113.34 134.39)",
  "lch(90.67% 52.832 196.45)",
  "lch(29.57% 131.21 301.369)",
  "lch(60.17% 111.41 327.109)",
  "lch(53.31% 89.31 200)",
  "lch(89.1% 167.34 3.6rad / 0.99)",
  "lch(24.494% 74.9 193grad)",
  "lch(47.39% 111.193 0.62turn / 75%)"
]
#+end_src

****** CIELCh(ab) Value Extraction

Now, I'll set up some extraction tests.

#+BEGIN_SRC js :results output code replace :allow read :noweb yes
const { valueExtractor } = await import(`${Deno.cwd()}/internals/color/formats.js`);

<<valid-lch>>

console.log("const colors =", colors.map((color) => ({ color, values: valueExtractor(color) })));
#+END_SRC

#+NAME: lch-values
#+begin_src js
const colors = [
  { color: "lch(0% 0 0)", values: [ "0%", "0", "0" ] },
  { color: "lch(53.59% 0 0)", values: [ "53.59%", "0", "0" ] },
  { color: "lch(100% 0 0)", values: [ "100%", "0", "0" ] },
  { color: "lch(54.29% 106.84 40.855)", values: [ "54.29%", "106.84", "40.855" ] },
  { color: "lch(97.6% 94.709 99.573)", values: [ "97.6%", "94.709", "99.573" ] },
  { color: "lch(87.82% 113.34 134.39)", values: [ "87.82%", "113.34", "134.39" ] },
  { color: "lch(90.67% 52.832 196.45)", values: [ "90.67%", "52.832", "196.45" ] },
  { color: "lch(29.57% 131.21 301.369)", values: [ "29.57%", "131.21", "301.369" ] },
  { color: "lch(60.17% 111.41 327.109)", values: [ "60.17%", "111.41", "327.109" ] },
  { color: "lch(53.31% 89.31 200)", values: [ "53.31%", "89.31", "200" ] },
  {
    color: "lch(89.1% 167.34 3.6rad / 0.99)",
    values: [ "89.1%", "167.34", "3.6rad", "0.99" ]
  },
  { color: "lch(24.494% 74.9 193grad)", values: [ "24.494%", "74.9", "193grad" ] },
  {
    color: "lch(47.39% 111.193 0.62turn / 75%)",
    values: [ "47.39%", "111.193", "0.62turn", "75%" ]
  }
]
#+end_src

And that's it. Full support for validating and extracting the values of all current (and future) CSS
color formats. Not very useful  by itself, so I'm going to write functionality to convert between them.

***** Oklab (LCh)

Oklab is a non-standard perceptual color space created by Bjrn Ottosson. It's a derivative of
CIELAB that fixes some of its shortcomings in predicting hue and especially sudden hue shifting of
blues toward purple.

I decided to support it after realizing that HSL is a terrible space to make color adjustments in
and standard CIELCh(ab) fell just short of my expectations for color scheme and variant generation.

It was this [[https://observablehq.com/@joshdata/perceptually-valid-color-scales][demonstration of perceptually valid color scales]] that finally convinced me that Oklab
had that special sauce.

As a bonus, it's simple to implement.

Quarks System Core processes Oklab colors in its polar coordinates form similar to CIELCh(ab) to
ease value extraction and adjustment.

Though, I should note that the chroma component uses a different range (=0-0.5=).

#+NAME: oklab-samples
| Color   | Value                       |
|---------+-----------------------------|
| Black   | =oklab(0% 0 0)=             |
| Gray    | =oklab(59.987% 0 0)=        |
| White   | =oklab(100% 0 0)=           |
| Red     | =oklab(62.795% 0.25768 29.234)= |
| Yellow  | =oklab(96.768% 0.21101 109.77)= |
| Green   | =oklab(86.644% 0.29483 142.5)= |
| Cyan    | =oklab(90.54% 0.15455 194.77)= |
| Blue    | =oklab(45.201% 0.31321 264.052)= |
| Magenta | =oklab(70.167% 0.32249 328.363)= |
| Etc.    | =oklab(37.119% 0.482 90)=   |
|         | =oklab(29.11% 0.25 180)=    |
|         | =oklab(53.33% 0.5 270)=     |
|         | =oklab(84% 0.1043 350.31)=  |
|         | =oklab(25.14% 0.44 60 / 0.8)= |

****** Oklab (LCh) Validator

The Oklab validator is similar to the standard CIELCh(ab) validator but the chroma token is replaced
with =CHROMA_TOK_OKLAB=.

#+BEGIN_SRC js :tangle "./internals/color/formats.js" :comments link
/** Validate: Oklab (LCh) format */
function oklabValidator(color) {
  return matchFunctionalFormat({ prefix: "oklab", legacy: false }, [
    CIE_LUM_TOK,
    CHROMA_TOK_OKLAB,
    HUE_TOK,
  ]).test(color);
}
#+END_SRC

Now for some tests.

#+BEGIN_SRC js :results output code replace :allow read :var oklabTable=oklab-samples
const { oklabValidator } = await import(`${Deno.cwd()}/internals/color/formats.js`);
const colors = oklabTable.map(([a, b]) => b.replace(/=/g, ""));

console.log("const colors =", colors.filter((color) => oklabValidator(color)))
#+END_SRC

#+NAME: valid-oklab
#+begin_src deno
const colors = [
  "oklab(0% 0 0)",
  "oklab(59.987% 0 0)",
  "oklab(100% 0 0)",
  "oklab(62.795% 0.25768 29.234)",
  "oklab(96.768% 0.21101 109.77)",
  "oklab(86.644% 0.29483 142.5)",
  "oklab(90.54% 0.15455 194.77)",
  "oklab(45.201% 0.31321 264.052)",
  "oklab(70.167% 0.32249 328.363)",
  "oklab(37.119% 0.482 90)",
  "oklab(29.11% 0.25 180)",
  "oklab(53.33% 0.5 270)",
  "oklab(84% 0.1043 350.31)",
  "oklab(25.14% 0.44 60 / 0.8)"
]
#+end_src

****** Oklab (LCh) Value Extraction

Now, I'll make sure the values are properly extracted.

#+BEGIN_SRC js :results output code replace :allow read :noweb yes
const { valueExtractor } = await import(`${Deno.cwd()}/internals/color/formats.js`);

<<valid-oklab>>

console.log("const colors =", colors.map((color) => ({ color, values: valueExtractor(color) })));
#+END_SRC

#+NAME: oklab-values
#+begin_src deno
const colors = [
  { color: "oklab(0% 0 0)", values: [ "0%", "0", "0" ] },
  { color: "oklab(59.987% 0 0)", values: [ "59.987%", "0", "0" ] },
  { color: "oklab(100% 0 0)", values: [ "100%", "0", "0" ] },
  {
    color: "oklab(62.795% 0.25768 29.234)",
    values: [ "62.795%", "0.25768", "29.234" ]
  },
  {
    color: "oklab(96.768% 0.21101 109.77)",
    values: [ "96.768%", "0.21101", "109.77" ]
  },
  {
    color: "oklab(86.644% 0.29483 142.5)",
    values: [ "86.644%", "0.29483", "142.5" ]
  },
  {
    color: "oklab(90.54% 0.15455 194.77)",
    values: [ "90.54%", "0.15455", "194.77" ]
  },
  {
    color: "oklab(45.201% 0.31321 264.052)",
    values: [ "45.201%", "0.31321", "264.052" ]
  },
  {
    color: "oklab(70.167% 0.32249 328.363)",
    values: [ "70.167%", "0.32249", "328.363" ]
  },
  { color: "oklab(37.119% 0.482 90)", values: [ "37.119%", "0.482", "90" ] },
  { color: "oklab(29.11% 0.25 180)", values: [ "29.11%", "0.25", "180" ] },
  { color: "oklab(53.33% 0.5 270)", values: [ "53.33%", "0.5", "270" ] },
  { color: "oklab(84% 0.1043 350.31)", values: [ "84%", "0.1043", "350.31" ] },
  { color: "oklab(25.14% 0.44 60 / 0.8)", values: [ "25.14%", "0.44", "60", "0.8" ] }
]
#+end_src

***** Batch Validation

Now I wrap the validators as a default export. This allows me to cherry pick the extractors as
they're needed in =conversions.js= but /iterate/ over the validators to break the process down to a
boolean condition: is this a color or not?

#+BEGIN_SRC js :tangle "./internals/color/formats.js" :comments link
export default new Map([
  ["named", namedValidator],
  ["hex", hexValidator],
  ["rgb", rgbValidator],
  ["hsl", hslValidator],
  ["cmyk", cmykValidator],
  ["hwb", hwbValidator],
  ["cielab", cielabValidator],
  ["cielch", cielchValidator],
  ["oklab", oklabValidator],
]);
#+END_SRC

**** Format Conversions (=internals/color/conversions.js=)

I refactored the conversion functions to eliminate that isolated value extraction step so that I
don't have to account for that explicitly in my conversion chains.

Instead of extracted values, they now work with colors directly. It was a totally unnecessary
"optimization" that I've since corrected.

I also discarded the previous =inputFormat.outputFormat(color)= structure in favor of a more
intentional naming convention.

+ =inputFormatToOutputFormat(color)=: indicates a forward conversion
+ =outputFormatFromInputFormat(color)=: indicates a back conversion

Finally, I flattened the whole thing down to a single file to minimize HTTP requests when importing
the library from its package URL.

***** RGB Hex Conversions

To reiterate, a hex color is the primitive color value. They may convert /to/ another format,
but can only be converted /from/ named colors.

