internals/color/formats.js

// [[file:../../README.org::*CIELAB Validator][CIELAB Validator:1]]
/** Validate: functional CIELAB format */
export function cielabValidator(color) {
  return matchFunctionalFormat({ prefix: "lab", legacy: false }, [
    CIE_LUM_TOK,
    ...Array(2).fill(HUE_TOK_CIELAB),
  ]).test(color);
}
// CIELAB Validator:1 ends here

// [[file:../../README.org::*CIELCh(ab) Validator][CIELCh(ab) Validator:1]]
/** Validate: functional CIELCh(ab) format */
export function cielchValidator(color) {
  return matchFunctionalFormat({ prefix: "lch", legacy: false }, [
    CIE_LUM_TOK,
    CHROMA_TOK,
    HUE_TOK,
  ]).test(color);
}
// CIELCh(ab) Validator:1 ends here

// [[file:../../README.org::*Oklab (LCh) Validator][Oklab (LCh) Validator:1]]
/** Validate: Oklab (LCh) format */
export function oklabValidator(color) {
  return matchFunctionalFormat({ prefix: "oklab", legacy: false }, [
    CIE_LUM_TOK,
    CHROMA_TOK_OKLAB,
    HUE_TOK,
  ]).test(color);
}
// Oklab (LCh) Validator:1 ends here
