README.org
****** RGB Hex to Functional RGB

Converting RGB Hex to functional RGB is a matter of extracting each channel hex fragment and
converting them to their equivalent integers. And then converting the alpha channel /if/ it exists.

#+BEGIN_SRC js :tangle "./internals/color/conversions.js" :comments link
import { calcFractionFromChannel, hexFragmentToChannel } from "./math.js";
import { hexExtractor, valueExtractor } from "./formats.js";

/** RGB Hex to Functional RGB */
function hexToRGB(color) {
  const [r, g, b, a] = hexExtractor(color);

  const [R, G, B] = [r, g, b].map((hex) => hexFragmentToChannel(hex));
  const A = (a && calcFractionFromChannel(hexFragmentToChannel(a ?? "ff"))) ||
    1;

  return A === 1 ? `rgb(${R}, ${G}, ${B})` : `rgba(${R}, ${G}, ${B}, ${A})`;
}
#+END_SRC

For testing my implementation, I'll reuse the extracted hex results above.

#+BEGIN_SRC js :results output code replace :allow read :noweb yes
const { hexToRGB } = await import(`${Deno.cwd()}/internals/color/conversions.js`);

<<valid-hex>>

console.log(colors.map((color) => ({input: color, output: hexToRGB(color) })));
#+END_SRC

#+NAME: hex-to-rgb
#+begin_src js
[
  { input: "#000000", output: "rgb(0, 0, 0)" },
  { input: "#808080", output: "rgb(128, 128, 128)" },
  { input: "#ffffff", output: "rgb(255, 255, 255)" },
  { input: "#ff0000", output: "rgb(255, 0, 0)" },
  { input: "#ffff00", output: "rgb(255, 255, 0)" },
  { input: "#00ff00", output: "rgb(0, 255, 0)" },
  { input: "#00ffff", output: "rgb(0, 255, 255)" },
  { input: "#0000ff", output: "rgb(0, 0, 255)" },
  { input: "#ff00ff", output: "rgb(255, 0, 255)" },
  { input: "#ace", output: "rgb(170, 204, 238)" },
  { input: "#bea", output: "rgb(187, 238, 170)" },
  { input: "#fed", output: "rgb(255, 238, 221)" },
  { input: "#face", output: "rgba(255, 170, 204, 0.9333)" },
  { input: "#cafe", output: "rgba(204, 170, 255, 0.9333)" },
  { input: "#deaded", output: "rgb(222, 173, 237)" },
  { input: "#c0ffee", output: "rgb(192, 255, 238)" },
  { input: "#4991ccaa", output: "rgba(73, 145, 204, 0.6667)" },
  { input: "#abcdef68", output: "rgba(171, 205, 239, 0.4078)" }
]
#+end_src

Success!

***** Named Color Conversion

****** RGB Hex from Named Color

After validation, the only possible conversion for a CSS named color is a query for its hex value.

#+BEGIN_SRC js :tangle "./internals/color/conversions.js" :comments link
import { X11Colors } from "../../data/color/w3c-x11.js";

/** RGB HEX <- W3C-X11 */
const hexFromNamed = (color) => X11Colors[color];
#+END_SRC

***** Functional RGB Conversion

Functional RGB operates as a nexus bridging the many formats supported by Quarks System Core. This
is because when designing for screens, every converted color must generally fall within the sRGB gamut.

Functional RGB conversions are slightly more complex than RGB Hex conversions, so they require a bit
of extra math. Luckily, I defined those arithmetic helpers, so I'll pull in the necessary ones.

#+BEGIN_SRC js :tangle "./internals/color/conversions.js" :comments link
import {
  calcChannelFromPercent,
  calcFractionFromPercent,
  calcHexFragmentFromAlpha,
  calcHueFromRad,
  calcPercentFromFraction,
  channelToHexFragment,
  correctHueCounterClockwise,
  enforcePrecision,
  normalize,
} from "./math.js";
#+END_SRC

After that, I need to write a function to ensure that the RGB(A) values I use for calculation are uniform.

#+BEGIN_SRC js :tangle "./internals/color/conversions.js" :comments link
/** A helper function to prep RGB values for calculations */
function parseRGB(color) {
  const [r, g, b, alpha] = valueExtractor(color);
  const value = (s) => parseFloat(s);

  const [R, G, B] = [r, g, b].map((channel) =>
    channel.endsWith("%")
      ? enforcePrecision(calcChannelFromPercent(value(channel)))
      : enforcePrecision(value(channel))
  );

  const a = value(alpha);
  const A = a != null
    ? (a > 1 ? enforcePrecision(calcFractionFromPercent(a)) : a)
    : 1;

  return A === 1 ? [R, G, B] : [R, G, B, A];
}
#+END_SRC

****** RGB Hex from Functional RGB

A regressive conversion is one that breaks a color down. Since an RGB color begins the chain to
higher conversions, that leaves RGB Hex as the only possible regression.

#+BEGIN_SRC js :tangle "./internals/color/conversions.js" :comments link
/** RGB Hex from Functional RGB */
function hexFromRGB(color) {
  const [r, g, b, alpha] = parseRGB(color);

  const [R, G, B] = [r, g, b].map((channel) => channelToHexFragment(channel));
  // Alpha is defined and not null
  const A = (alpha && calcHexFragmentFromAlpha(alpha)) || "ff";

  return A === "ff" ? `#${R}${G}${B}` : `#${R}${G}${B}${A}`;
}
#+END_SRC

Now, I'll use the RGB output defined earlier to test my conversions for accuracy.

#+BEGIN_SRC js :results output code replace :allow read :noweb yes
const { hexFromRGB } = await import(`${Js.cwd()}/internals/color/conversions.js`);

<<valid-rgb>>

console.log(colors.map((color) => ({ input: color, output: hexFromRGB(color) })));
#+END_SRC

#+NAME: hex-from-rgb
#+begin_src js
[
  { input: "rgb(0, 0, 0)", output: "#000000" },
  { input: "rgb(128, 128, 128)", output: "#808080" },
  { input: "rgb(255, 255, 255)", output: "#ffffff" },
  { input: "rgb(255, 0, 0)", output: "#ff0000" },
  { input: "rgb(255, 255, 0)", output: "#ffff00" },
  { input: "rgb(0, 255, 0)", output: "#00ff00" },
  { input: "rgb(0, 255, 255)", output: "#00ffff" },
  { input: "rgb(0, 0, 255)", output: "#0000ff" },
  { input: "rgb(255, 0, 255)", output: "#ff00ff" },
  { input: "rgb(33, 199, 95)", output: "#21c75f" },
  { input: "rgb(19, 114, 220)", output: "#1372dc" },
  { input: "rgb(10%, 40.4%, 49.9%)", output: "#1a677f" },
  { input: "rgb(200 138 39)", output: "#c88a27" },
  { input: "rgb(31 88 49 / 0.8)", output: "#1f5831cc" },
  { input: "rgba(110, 33, 110, 0.75)", output: "#6e216ebf" },
  { input: "rgba(10, 119, 30, 30%)", output: "#0a771e4d" }
]
#+end_src

****** Functional RGB to Functional HSL

Functional RGB to Functional HSL conversion was supported in QuarkSuite 1, so the algorithm hasn't
changed its implementation. First, it requires a little prep.

#+BEGIN_SRC js :tangle "./internals/color/conversions.js" :comments link
// https://www.rapidtables.com/convert/color/rgb-to-hsl.html
const calcHue = (R, G, B, cmax, delta) =>
  new Map([
    [0, delta === 0],
    [60 * (((G - B) / delta) % 6), cmax === R],
    [60 * ((B - R) / delta + 2), cmax === G],
    [60 * ((R - G) / delta + 4), cmax === B],
  ]);

const calcSat = (delta, L) =>
  delta === 0 ? 0 : delta / (1 - Math.abs(2 * L - 1));

const calcLightness = (cmin, cmax) => (cmax + cmin) / 2;

function calcHSL(r, g, b) {
  const [R, G, B] = [r, g, b].map((channel) =>
    calcFractionFromChannel(channel)
  );

  const cmin = Math.min(R, G, B);
  const cmax = Math.max(R, G, B);
  const delta = cmax - cmin;

  const [H] = Array.from(calcHue(R, G, B, cmax, delta))
    .filter(([, condition]) => condition)
    .flatMap(([value]) => Math.round(value));

  const L = calcLightness(cmin, cmax);

  const S = calcSat(delta, L);

  return [Math.sign(H) === -1 ? correctHueCounterClockwise(H) : H, S, L];
}
#+END_SRC

And now the actual conversion algorithm:

#+BEGIN_SRC js :tangle "./internals/color/conversions.js" :comments link
/** Functional RGB to Functional HSL */
function rgbToHSL(color) {
  const [r, g, b, alpha] = parseRGB(color);
  const [h, s, l] = calcHSL(r, g, b);

  const [H, S, L] = [
    h,
    enforcePrecision(calcPercentFromFraction(s)),
    enforcePrecision(calcPercentFromFraction(l)),
  ];
  const A = (alpha && (alpha ?? 1)) || 1;

  return A === 1 ? `hsl(${H}, ${S}%, ${L}%)` : `hsla(${H}, ${S}%, ${L}%, ${A})`;
}
#+END_SRC

Time for some color conversion tests!

#+BEGIN_SRC js :results output code replace :allow read :noweb yes
const { rgbToHSL } = await import(`${Js.cwd()}/internals/color/conversions.js`);

<<valid-rgb>>

console.log(colors.map((color) => ({input: color, output: rgbToHSL(color)})));
#+END_SRC

#+NAME: rgb-to-hsl
#+begin_src js
[
  { input: "rgb(0, 0, 0)", output: "hsl(0, 0%, 0%)" },
  { input: "rgb(128, 128, 128)", output: "hsl(0, 0%, 50.2%)" },
  { input: "rgb(255, 255, 255)", output: "hsl(0, 0%, 100%)" },
  { input: "rgb(255, 0, 0)", output: "hsl(0, 100%, 50%)" },
  { input: "rgb(255, 255, 0)", output: "hsl(60, 100%, 50%)" },
  { input: "rgb(0, 255, 0)", output: "hsl(120, 100%, 50%)" },
  { input: "rgb(0, 255, 255)", output: "hsl(180, 100%, 50%)" },
  { input: "rgb(0, 0, 255)", output: "hsl(240, 100%, 50%)" },
  { input: "rgb(255, 0, 255)", output: "hsl(300, 100%, 50%)" },
  { input: "rgb(33, 199, 95)", output: "hsl(142, 71.55%, 45.49%)" },
  { input: "rgb(19, 114, 220)", output: "hsl(212, 84.1%, 46.86%)" },
  { input: "rgb(10%, 40.4%, 49.9%)", output: "hsl(194, 66.6%, 29.94%)" },
  { input: "rgb(200 138 39)", output: "hsl(37, 67.37%, 46.86%)" },
  { input: "rgb(31 88 49 / 0.8)", output: "hsla(139, 47.89%, 23.34%, 0.8)" },
  { input: "rgba(110, 33, 110, 0.75)", output: "hsla(300, 53.85%, 28.04%, 0.75)" },
  { input: "rgba(10, 119, 30, 30%)", output: "hsla(131, 84.5%, 25.3%, 0.3)" }
]
#+end_src

Booyah!

