internals/color/conversions.js
// [[file:../../README.org::*RGB Hex to Functional RGB][RGB Hex to Functional RGB:1]]
import { calcFractionFromChannel, hexFragmentToChannel } from "./math.js";
import { hexExtractor, valueExtractor } from "./formats.js";

/** RGB Hex to Functional RGB */
export function hexToRGB(color) {
  const [r, g, b, a] = hexExtractor(color);

  const [R, G, B] = [r, g, b].map((hex) => hexFragmentToChannel(hex));
  const A = (a && calcFractionFromChannel(hexFragmentToChannel(a ?? "ff"))) ||
    1;

  return A === 1 ? `rgb(${R}, ${G}, ${B})` : `rgba(${R}, ${G}, ${B}, ${A})`;
}
// RGB Hex to Functional RGB:1 ends here

// [[file:../../README.org::*RGB Hex from Named Color][RGB Hex from Named Color:1]]
import { X11Colors } from "../../data/color/w3c-x11.js";

/** RGB HEX <- W3C-X11 */
export const hexFromNamed = (color) => X11Colors[color];
// RGB Hex from Named Color:1 ends here

// [[file:../../README.org::*Functional RGB Conversion][Functional RGB Conversion:1]]
import {
  calcChannelFromPercent,
  calcFractionFromPercent,
  calcHexFragmentFromAlpha,
  calcHueFromRad,
  calcPercentFromFraction,
  channelToHexFragment,
  correctHueCounterClockwise,
  enforcePrecision,
  normalize,
} from "./math.js";
// Functional RGB Conversion:1 ends here

// [[file:../../README.org::*Functional RGB Conversion][Functional RGB Conversion:2]]
/** A helper function to prep RGB values for calculations */
function parseRGB(color) {
  const [r, g, b, alpha] = valueExtractor(color);
  const value = (s) => parseFloat(s);

  const [R, G, B] = [r, g, b].map((channel) =>
    channel.endsWith("%")
      ? enforcePrecision(calcChannelFromPercent(value(channel)))
      : enforcePrecision(value(channel))
  );

  const a = value(alpha);
  const A = a != null
    ? (a > 1 ? enforcePrecision(calcFractionFromPercent(a)) : a)
    : 1;

  return A === 1 ? [R, G, B] : [R, G, B, A];
}
// Functional RGB Conversion:2 ends here

// [[file:../../README.org::*RGB Hex from Functional RGB][RGB Hex from Functional RGB:1]]
/** RGB Hex from Functional RGB */
export function hexFromRGB(color) {
  const [r, g, b, alpha] = parseRGB(color);

  const [R, G, B] = [r, g, b].map((channel) => channelToHexFragment(channel));
  // Alpha is defined and not null
  const A = (alpha && calcHexFragmentFromAlpha(alpha)) || "ff";

  return A === "ff" ? `#${R}${G}${B}` : `#${R}${G}${B}${A}`;
}
// RGB Hex from Functional RGB:1 ends here

// [[file:../../README.org::*Functional RGB to Functional HSL][Functional RGB to Functional HSL:1]]
// https://www.rapidtables.com/convert/color/rgb-to-hsl.html
const calcHue = (R, G, B, cmax, delta) =>
  new Map([
    [0, delta === 0],
    [60 * (((G - B) / delta) % 6), cmax === R],
    [60 * ((B - R) / delta + 2), cmax === G],
    [60 * ((R - G) / delta + 4), cmax === B],
  ]);

const calcSat = (delta, L) =>
  delta === 0 ? 0 : delta / (1 - Math.abs(2 * L - 1));

const calcLightness = (cmin, cmax) => (cmax + cmin) / 2;

function calcHSL(r, g, b) {
  const [R, G, B] = [r, g, b].map((channel) =>
    calcFractionFromChannel(channel)
  );

  const cmin = Math.min(R, G, B);
  const cmax = Math.max(R, G, B);
  const delta = cmax - cmin;

  const [H] = Array.from(calcHue(R, G, B, cmax, delta))
    .filter(([, condition]) => condition)
    .flatMap(([value]) => Math.round(value));

  const L = calcLightness(cmin, cmax);

  const S = calcSat(delta, L);

  return [Math.sign(H) === -1 ? correctHueCounterClockwise(H) : H, S, L];
}
// Functional RGB to Functional HSL:1 ends here

// [[file:../../README.org::*Functional RGB to Functional HSL][Functional RGB to Functional HSL:2]]
/** Functional RGB to Functional HSL */
export function rgbToHSL(color) {
  const [r, g, b, alpha] = parseRGB(color);
  const [h, s, l] = calcHSL(r, g, b);

  const [H, S, L] = [
    h,
    enforcePrecision(calcPercentFromFraction(s)),
    enforcePrecision(calcPercentFromFraction(l)),
  ];
  const A = (alpha && (alpha ?? 1)) || 1;

  return A === 1 ? `hsl(${H}, ${S}%, ${L}%)` : `hsla(${H}, ${S}%, ${L}%, ${A})`;
}
// Functional RGB to Functional HSL:2 ends here

// [[file:../../README.org::*Functional RGB to Device CMYK][Functional RGB to Device CMYK:1]]
/** Functional RGB to Device CMYK */
