README.org
****** Functional RGB to Device CMYK

And now I drift again into unfamiliar terrain, but RapidTables is there again to provide a map.

#+BEGIN_SRC js :tangle "./internals/color/conversions.js" :comments link
/** Functional RGB to Device CMYK */
function rgbToCMYK(color) {
  const [r, g, b, alpha] = parseRGB(color);
  const [R, G, B] = [r, g, b].map((channel) =>
    calcFractionFromChannel(channel)
  );

  // https://www.rapidtables.com/convert/color/rgb-to-cmyk.html
  const k = 1 - Math.max(R, G, B);
  const [c, m, y] = [R, G, B].map((channel) => (1 - channel - k) / (1 - k));
  const A = (alpha && (alpha ?? 1)) || 1;

  // Many examples in the CSS Color Module Level 4 use the percentage format,
  // so I'm assuming that's the preferred format in conversions.
  const [C, M, Y, K] = [c, m, y, k].map((component) =>
    isNaN(component) ? 0 : enforcePrecision(calcPercentFromFraction(component))
  );

  return A === 1
    ? `device-cmyk(${C}% ${M}% ${Y}% ${K}%)`
    : `device-cmyk(${C}% ${M}% ${Y}% ${K}% / ${A})`;
}
#+END_SRC

Now, I'm checking the math.

#+BEGIN_SRC js :results output code replace :allow read :noweb yes
const { rgbToCMYK } = await import(`${Deno.cwd()}/internals/color/conversions.js`);

<<valid-rgb>>

console.log(colors.map((color) => ({input: color, output: rgbToCMYK(color)})));
#+END_SRC

#+NAME: rgb-to-cmyk
#+begin_src js
[
  { input: "rgb(0, 0, 0)", output: "device-cmyk(0% 0% 0% 100%)" },
  { input: "rgb(128, 128, 128)", output: "device-cmyk(0% 0% 0% 49.8%)" },
  { input: "rgb(255, 255, 255)", output: "device-cmyk(0% 0% 0% 0%)" },
  { input: "rgb(255, 0, 0)", output: "device-cmyk(0% 100% 100% 0%)" },
  { input: "rgb(255, 255, 0)", output: "device-cmyk(0% 0% 100% 0%)" },
  { input: "rgb(0, 255, 0)", output: "device-cmyk(100% 0% 100% 0%)" },
  { input: "rgb(0, 255, 255)", output: "device-cmyk(100% 0% 0% 0%)" },
  { input: "rgb(0, 0, 255)", output: "device-cmyk(100% 100% 0% 0%)" },
  { input: "rgb(255, 0, 255)", output: "device-cmyk(0% 100% 0% 0%)" },
  { input: "rgb(33, 199, 95)", output: "device-cmyk(83.42% 0% 52.27% 21.96%)" },
  { input: "rgb(19, 114, 220)", output: "device-cmyk(91.36% 48.17% 0% 13.73%)" },
  { input: "rgb(10%, 40.4%, 49.9%)", output: "device-cmyk(79.52% 18.9% 0% 50.2%)" },
  { input: "rgb(200 138 39)", output: "device-cmyk(0% 31% 80.5% 21.57%)" },
  {
    input: "rgb(31 88 49 / 0.8)",
    output: "device-cmyk(64.76% 0% 44.31% 65.49% / 0.8)"
  },
  {
    input: "rgba(110, 33, 110, 0.75)",
    output: "device-cmyk(0% 70% 0% 56.86% / 0.75)"
  },
  {
    input: "rgba(10, 119, 30, 30%)",
    output: "device-cmyk(91.6% 0% 74.8% 53.33% / 0.3)"
  }
]
#+end_src

Seems to check out, but I'm going to implement some visual tests soon.

****** Functional RGB to Functional HWB

The conversion of RGB to HWB is a little unorthodox. It's technically a /composite/ conversion. The
hue is first calculated via partial HSL conversion, and then the amount of white and black is
calculated via a [[https://www.w3.org/TR/css-color-4/#rgb-to-hwb][modified formula from the spec itself]].

#+BEGIN_SRC js :tangle "./internals/color/conversions.js" :comments link
/** Functional RGB to Functional HWB */
function rgbToHWB(color) {
  const [r, g, b, alpha] = parseRGB(color);
  const [R, G, B] = [r, g, b].map((channel) =>
    calcFractionFromChannel(channel)
  );

  const [H] = calcHSL(r, g, b);
  const [W, BLK] = [
    enforcePrecision(calcPercentFromFraction(Math.min(R, G, B))),
    enforcePrecision(calcPercentFromFraction(1 - Math.max(R, G, B))),
  ];
  const A = (alpha && (alpha ?? 1)) || 1;

  return A === 1 ? `hwb(${H} ${W}% ${BLK}%)` : `hwb(${H} ${W}% ${BLK}% / ${A})`;
}
#+END_SRC

I'm suspicious of the math here, so let's see the proof.

#+BEGIN_SRC js :results output code replace :allow read :noweb yes
const { rgbToHWB } = await import(`${Deno.cwd()}/internals/color/conversions.js`);

<<valid-rgb>>

console.log(colors.map((color) => ({input: color, output: rgbToHWB(color)})));
#+END_SRC

#+NAME: rgb-to-hwb
#+begin_src js
[
  { input: "rgb(0, 0, 0)", output: "hwb(0 0% 100%)" },
  { input: "rgb(128, 128, 128)", output: "hwb(0 50.2% 49.8%)" },
  { input: "rgb(255, 255, 255)", output: "hwb(0 100% 0%)" },
  { input: "rgb(255, 0, 0)", output: "hwb(0 0% 0%)" },
  { input: "rgb(255, 255, 0)", output: "hwb(60 0% 0%)" },
  { input: "rgb(0, 255, 0)", output: "hwb(120 0% 0%)" },
  { input: "rgb(0, 255, 255)", output: "hwb(180 0% 0%)" },
  { input: "rgb(0, 0, 255)", output: "hwb(240 0% 0%)" },
  { input: "rgb(255, 0, 255)", output: "hwb(300 0% 0%)" },
  { input: "rgb(33, 199, 95)", output: "hwb(142 12.94% 21.96%)" },
  { input: "rgb(19, 114, 220)", output: "hwb(212 7.451% 13.73%)" },
  { input: "rgb(10%, 40.4%, 49.9%)", output: "hwb(194 10.2% 50.2%)" },
  { input: "rgb(200 138 39)", output: "hwb(37 15.29% 21.57%)" },
  { input: "rgb(31 88 49 / 0.8)", output: "hwb(139 12.16% 65.49% / 0.8)" },
  { input: "rgba(110, 33, 110, 0.75)", output: "hwb(300 12.94% 56.86% / 0.75)" },
  { input: "rgba(10, 119, 30, 30%)", output: "hwb(131 3.922% 53.33% / 0.3)" }
]
#+end_src

I'll test this more , but the results are about what I'd expect.

****** Functional RGB to Functional CIELAB

CIEXYZ is a necessary waypoint on the road to CIELAB conversion indicating a set of general
coordinates based on the range of colors perceptible by the human eye.

Linear RGB is RGB with the gamma removed as that would throw off the calculation of CIEXYZ.

You can [[https://www.image-engineering.de/library/technotes/958-how-to-convert-between-srgb-and-ciexyz][read more about the actual formula]] if you're curious.

#+BEGIN_SRC js :tangle "./internals/color/conversions.js" :comments link
/** Functional RGB >-< Linear RGB */
const removeGamma = (rgb) =>
  rgb.map((v) => {
    const V = calcFractionFromChannel(v);
    return V <= 0.04045 ? V / 12.92 : ((V + 0.055) / 1.055) ** 2.4;
  });
#+END_SRC

Now, to convert the ungamma-ed RGB to XYZ data, we have to pass it through a transformation matrix
of values representing the D65 reference white point defined in sRGB, which CSS uses.

After, I need to apply the [[http://www.brucelindbloom.com/Eqn_ChromAdapt.html][Bradford method of chromatic adaptation]] to convert the illuminant from
D65 to D50.

#+BEGIN_SRC js :tangle "./internals/color/conversions.js" :comments link
/** Linear RGB to CIE XYZ */
function calcXYZ(rgb) {
  const [R, G, B] = removeGamma(rgb);
  const [X, Y, Z] = [
    R * 0.4124564 + G * 0.3575761 + B * 0.1804375,
    R * 0.2126729 + G * 0.7151522 + B * 0.072175,
    R * 0.0193339 + G * 0.119192 + B * 0.9503041,
  ];

  /*
   * D50 matrix
   * =============================
   * 1.0478112  0.0228866 -0.0501270
   * 0.0295424  0.9904844 -0.0170491
   * -0.0092345  0.0150436  0.7521316
   * =============================
   */
  return [
    X * 1.0478112 + Y * 0.0228866 + Z * -0.050127,
    X * 0.0295424 + Y * 0.9904844 + Z * -0.0170491,
    X * -0.0092345 + Y * 0.0150436 + Z * 0.7521316,
  ];
}
#+END_SRC

And then I need to apply the actual [[http://www.brucelindbloom.com/index.html?Equations.html][conversion formula]].

#+BEGIN_SRC js :tangle "./internals/color/conversions.js" :comments link
/** Functional RGB to Functional CIELAB */
function rgbToCielab(color) {
  const [r, g, b, alpha] = parseRGB(color);
  const [x, y, z] = calcXYZ([r, g, b]);

  // CIE standards
  const  = 216 / 24389;
  const  = 24389 / 27;
  const white = [0.96422, 1.0, 0.82521]; // D50 reference white

  // Calculating XYZ scaled relative to white
  const [X, Y, Z] = [x, y, z].map((v, i) => v / white[i]);
  // Calculating F for each value
  const [FX, FY, FZ] = [X, Y, Z].map((V) =>
    V >  ? Math.cbrt(V) : ( * V + 16) / 116
  );

  // Calculating Lab values and limiting the precision
  const [L, aHue, bHue] = [
    enforcePrecision(116 * FY - 16),
    enforcePrecision(500 * (FX - FY)),
    enforcePrecision(200 * (FY - FZ)),
  ].map((V) => (Math.sign(Math.round(V)) === 0 ? 0 : V));
  const A = (alpha && (alpha ?? 1)) || 1;

  return A === 1
    ? `lab(${L}% ${aHue} ${bHue})`
    : `lab(${L}% ${aHue} ${bHue} / ${A})`;
}
#+END_SRC

That was a lot, so I'm going to run my tests now.

#+BEGIN_SRC js :results output code replace :allow read :noweb yes
const { rgbToCielab } = await import(`${Deno.cwd()}/internals/color/conversions.js`);

<<valid-rgb>>

console.log(colors.map((color) => ({input: color, output: rgbToCielab(color)})));
#+END_SRC

#+NAME: rgb-to-cielab
#+begin_src js
[
  { input: "rgb(0, 0, 0)", output: "lab(0% 0 0)" },
  { input: "rgb(128, 128, 128)", output: "lab(53.59% 0 0)" },
  { input: "rgb(255, 255, 255)", output: "lab(100% 0 0)" },
  { input: "rgb(255, 0, 0)", output: "lab(54.29% 80.81 69.89)" },
  { input: "rgb(255, 255, 0)", output: "lab(97.61% -15.75 93.39)" },
  { input: "rgb(0, 255, 0)", output: "lab(87.82% -79.29 80.99)" },
  { input: "rgb(0, 255, 255)", output: "lab(90.67% -50.67 -14.96)" },
  { input: "rgb(0, 0, 255)", output: "lab(29.57% 68.3 -112)" },
  { input: "rgb(255, 0, 255)", output: "lab(60.17% 93.55 -60.5)" },
  { input: "rgb(33, 199, 95)", output: "lab(70.85% -58.58 39.73)" },
  { input: "rgb(19, 114, 220)", output: "lab(47.69% 5.882 -62.48)" },
  { input: "rgb(10%, 40.4%, 49.9%)", output: "lab(39.98% -16.95 -20.4)" },
  { input: "rgb(200 138 39)", output: "lab(62.67% 18.46 58.58)" },
  { input: "rgb(31 88 49 / 0.8)", output: "lab(32.89% -26.87 16.88 / 0.8)" },
  { input: "rgba(110, 33, 110, 0.75)", output: "lab(28.13% 41.67 -27.61 / 0.75)" },
  { input: "rgba(10, 119, 30, 30%)", output: "lab(43.32% -42.99 38.13 / 0.3)" }
]
#+end_src

Awesome.

