README.org
****** Functional RGB to Oklab (LCh)

[[https://bottoson.github.io/posts/oklab][Oklab]] is a perceptual color space for image processing created by Bjrn Ottosson. It has all the
advantages of CIELAB but fewer of its drawbacks in hue shifting (especially with blues).

This makes it excellent for adjusting color properties and blending colors.

I specifically use the formulas for converting Linear RGB to/from Oklab to convert to Oklab (LCh)
and ensure the output stays within the sRGB gamut.

#+BEGIN_SRC js :tangle "./internals/color/conversions.js" :comments link
function calcOklab(r, g, b) {
  const [R, G, B] = removeGamma([r, g, b]);

  // Convert to LMS cone activations and apply non-linearity
  const [L, M, S] = [
    R * 0.4122214708 + G * 0.5363325363 + B * 0.0514459929,
    R * 0.2119034982 + G * 0.6806995451 + B * 0.1073969566,
    R * 0.0883024619 + G * 0.2817188376 + B * 0.6299787005,
  ].map((V) => Math.cbrt(V));

  // Calculate Oklab values
  return [
    L * 0.2104542553 + M * 0.793617785 - S * 0.0040720468,
    L * 1.9779984951 - M * 2.428592205 + S * 0.4505937099,
    L * 0.0259040371 + M * 0.7827717662 - S * 0.808675766,
  ];
}

function rgbToOklab(color) {
  const [r, g, b, alpha] = parseRGB(color);
  const [l, aHue, bHue] = calcOklab(r, g, b);

  const L = `${enforcePrecision(calcPercentFromFraction(l))}%`;
  const c = enforcePrecision(Math.sqrt(aHue ** 2 + bHue ** 2));
  const h = enforcePrecision(Math.atan2(bHue, aHue) * (180 / Math.PI));

  const C = Math.sign(Math.round(c)) === 0 ? 0 : c; // Ensure negative values lock at 0
  const H = Math.sign(h) === -1 ? correctHueCounterClockwise(h) : h;

  const A = (alpha && (alpha ?? 1)) || 1;

  return A === 1 ? `oklab(${L} ${C} ${H})` : `oklab(${L} ${C} ${H} / ${A})`;
}
#+END_SRC

Now, I'll do some quick tests.

#+BEGIN_SRC js :results output code replace :allow read :noweb yes
const { rgbToOklab } = await import(`${Deno.cwd()}/internals/color/conversions.js`);

<<valid-rgb>>

console.log(colors.map((color) => ({input: color, output: rgbToOklab(color)})));
#+END_SRC

#+NAME: rgb-to-oklab
#+begin_src js
[
  { input: "rgb(0, 0, 0)", output: "oklab(0% 0 0)" },
  { input: "rgb(128, 128, 128)", output: "oklab(59.99% 0 89.88)" },
  { input: "rgb(255, 255, 255)", output: "oklab(100% 0 89.88)" },
  { input: "rgb(255, 0, 0)", output: "oklab(62.8% 0 29.23)" },
  { input: "rgb(255, 255, 0)", output: "oklab(96.8% 0 109.8)" },
  { input: "rgb(0, 255, 0)", output: "oklab(86.64% 0 142.5)" },
  { input: "rgb(0, 255, 255)", output: "oklab(90.54% 0 194.8)" },
  { input: "rgb(0, 0, 255)", output: "oklab(45.2% 0 264.1)" },
  { input: "rgb(255, 0, 255)", output: "oklab(70.17% 0 328.4)" },
  { input: "rgb(33, 199, 95)", output: "oklab(72.8% 0 149.6)" },
  { input: "rgb(19, 114, 220)", output: "oklab(56.18% 0 255.9)" },
  { input: "rgb(10%, 40.4%, 49.9%)", output: "oklab(47.98% 0 223.7)" },
  { input: "rgb(200 138 39)", output: "oklab(67.96% 0 73.68)" },
  { input: "rgb(31 88 49 / 0.8)", output: "oklab(41.18% 0 151 / 0.8)" },
  { input: "rgba(110, 33, 110, 0.75)", output: "oklab(39.98% 0 327.9 / 0.75)" },
  { input: "rgba(10, 119, 30, 30%)", output: "oklab(49.59% 0 144.6 / 0.3)" }
]
#+end_src

***** Functional HSL Conversion

HSL is a polar coordinate translation of RGB so you can only derive an RGB color from it.

****** Functional RGB from Functional HSL

First, the extracted values require some prepping before calculations are predictable.

#+BEGIN_SRC js :tangle "./internals/color/conversions.js" :comments link
import {
  calcChannelFromFraction,
  calcHueFromGrad,
  calcHueFromTurn,
  correctHueClockwise,
} from "./math.js";

// https://www.rapidtables.com/convert/color/hsl-to-rgb.html
const calcChannels = (C, X, H) =>
  new Map([
    [[C, X, 0], 0 <= H && H < 60],
    [[X, C, 0], 60 <= H && H < 120],
    [[0, C, X], 120 <= H && H < 180],
    [[0, X, C], 180 <= H && H < 240],
    [[X, 0, C], 240 <= H && H < 300],
    [[C, 0, X], 300 <= H && H < 360],
  ]);

function parseHSL(color) {
  const [h, s, l, alpha] = valueExtractor(color);

  const [H] = [h].map((value) => {
    const n = parseFloat(value);
    const isNegative = (n) => Math.sign(n) === -1;
    let hue;

    // Set hue based on unit
    if (value.endsWith("grad")) {
      hue = isNegative(n) ? calcHueFromGrad(n + 400) : calcHueFromGrad(n);
    } else if (value.endsWith("rad")) {
      hue = isNegative(n) ? calcHueFromRad(n + 6.28319) : calcHueFromRad(n);
    } else if (value.endsWith("turn")) {
      hue = isNegative(n) ? calcHueFromTurn(n + 1) : calcHueFromTurn(n);
    } else {
      hue = n;
    }

    // hue correction
    let degrees;
    if (hue >= 360) {
      degrees = correctHueClockwise(hue);
    } else if (isNegative(hue)) {
      degrees = correctHueClockwise(correctHueCounterClockwise(hue));
    } else {
      degrees = hue;
    }

    return degrees;
  });

  const [S, L] = [s, l].map((value) => {
    const n = parseFloat(value);
    return calcFractionFromPercent(n);
  });

  const a = parseFloat(alpha);
  const A = a != null ? (a > 1 ? calcFractionFromPercent(a) : a) : 1;

  return A === 1 ? [H, S, L] : [H, S, L, A];
}

function calcRGB(h, s, l) {
  // Calculate chroma
  const C = (1 - Math.abs(2 * l - 1)) * s;
  const X = C * (1 - Math.abs(((h / 60) % 2) - 1));
  const m = l - C / 2;

  // Evaluate channels
  const [R, G, B] = Array.from(calcChannels(C, X, h))
    .filter(([, condition]) => condition)
    .flatMap(([evaluation]) => evaluation)
    .map((channel) => Math.round(calcChannelFromFraction(channel + m)));

  return [R, G, B];
}
#+END_SRC

Phew. Now for the actual conversion function, it's an inversion.

#+BEGIN_SRC js :tangle "./internals/color/conversions.js" :comments link
/** Functional RGB from Functional HSL */
function rgbFromHSL(color) {
  const [h, s, l, alpha] = parseHSL(color);
  const [R, G, B] = calcRGB(h, s, l);

  const A = (alpha && (alpha ?? 1)) || 1;

  return A === 1 ? `rgb(${R}, ${G}, ${B})` : `rgba(${R}, ${G}, ${B}, ${A})`;
}
#+END_SRC

Now, the tests with my extracted HSL to verify that the math checks out.

#+BEGIN_SRC js :results output code replace :allow read :noweb yes
const { rgbFromHSL } = await import(`${Deno.cwd()}/internals/color/conversions.js`);

<<valid-hsl>>

console.log(colors.map((color) => ({input: color, output: rgbFromHSL(color)})));
#+END_SRC

#+NAME: rgb-from-hsl
#+begin_src js
[
  { input: "hsl(0, 0%, 0%)", output: "rgb(0, 0, 0)" },
  { input: "hsl(0, 0%, 50%)", output: "rgb(128, 128, 128)" },
  { input: "hsl(0, 0%, 100%)", output: "rgb(255, 255, 255)" },
  { input: "hsl(0, 100%, 50%)", output: "rgb(255, 0, 0)" },
  { input: "hsl(60, 100%, 50%)", output: "rgb(255, 255, 0)" },
  { input: "hsl(120, 100%, 50%)", output: "rgb(0, 255, 0)" },
  { input: "hsl(180, 100%, 50%)", output: "rgb(0, 255, 255)" },
  { input: "hsl(240, 100%, 50%)", output: "rgb(0, 0, 255)" },
  { input: "hsl(300, 100%, 50%)", output: "rgb(255, 0, 255)" },
  { input: "hsl(38, 78%, 40%)", output: "rgb(182, 123, 22)" },
  { input: "hsl(3 88% 70%)", output: "rgb(246, 118, 111)" },
  { input: "hsl(189 63% 85% / 0.71)", output: "rgba(193, 234, 241, 0.71)" },
  { input: "hsla(1.5rad, 73%, 10%, 0.831)", output: "rgba(28, 44, 7, 0.831)" },
  { input: "hsl(320grad 89% 36% / 79%)", output: "rgba(141, 10, 174, 0.79)" },
  { input: "hsl(0.36turn 83% 90%)", output: "rgb(208, 251, 215)" }
]
#+end_src

***** Device CMYK Conversion

CMYK is like HSL in that it's another endpoint where the only way to continue a conversion chain is
to derive an RGB color from it.

****** Functional RGB from Device CMYK

First, I'm gonna enforce some uniformity in my values.

#+BEGIN_SRC js :tangle "./internals/color/conversions.js" :comments link
function parseCMYK(color) {
  const [c, m, y, k, alpha] = valueExtractor(color);
  const value = (s) => parseFloat(s);
  const [C, M, Y, K] = [c, m, y, k].map((component) =>
    component.endsWith("%")
      ? calcFractionFromPercent(value(component))
      : value(component)
  );

  const a = value(alpha);
  const A = a != null ? (a > 1 ? calcFractionFromPercent(a) : a) : 1;

  return A === 1 ? [C, M, Y, K] : [C, M, Y, K, A];
}
#+END_SRC

For the conversion algorithm, it's RapidTables coming again with the assist.

#+BEGIN_SRC js :tangle "./internals/color/conversions.js" :comments link
/** Functional RGB from Device CMYK */
function rgbFromCMYK(color) {
  const [C, M, Y, K, alpha] = parseCMYK(color);

  const [R, G, B] = [C, M, Y].map((component) =>
    Math.round(calcChannelFromFraction((1 - component) * (1 - K)))
  );
  const A = (alpha && (alpha ?? 1)) || 1;

  return A === 1 ? `rgb(${R}, ${G}, ${B})` : `rgba(${R}, ${G}, ${B}, ${A})`;
}
#+END_SRC

Time to see if the math stacks up.

#+BEGIN_SRC js :results output code replace :allow read :noweb yes
const { rgbFromCMYK } = await import(`${Deno.cwd()}/internals/color/conversions.js`);

<<valid-cmyk>>

console.log(colors.map((color) => ({input: color, output: rgbFromCMYK(color)})));
#+END_SRC

#+NAME: rgb-from-cmyk
#+begin_src js
[
  { input: "device-cmyk(0% 0% 0% 100%)", output: "rgb(0, 0, 0)" },
  { input: "device-cmyk(0% 0% 0% 50%)", output: "rgb(128, 128, 128)" },
  { input: "device-cmyk(0% 0% 0% 0%)", output: "rgb(255, 255, 255)" },
  { input: "device-cmyk(0% 100% 100% 0%)", output: "rgb(255, 0, 0)" },
  { input: "device-cmyk(0% 0% 100% 0%)", output: "rgb(255, 255, 0)" },
  { input: "device-cmyk(100% 0% 100% 0%)", output: "rgb(0, 255, 0)" },
  { input: "device-cmyk(100% 0% 0% 0%)", output: "rgb(0, 255, 255)" },
  { input: "device-cmyk(100% 100% 0% 0%)", output: "rgb(0, 0, 255)" },
  { input: "device-cmyk(0% 100% 0% 0%)", output: "rgb(255, 0, 255)" },
  { input: "device-cmyk(37% 63% 0 0)", output: "rgb(161, 94, 255)" },
  { input: "device-cmyk(50% 25% 10% 0)", output: "rgb(128, 191, 230)" },
  { input: "device-cmyk(0.77 0.33 0 0)", output: "rgb(59, 171, 255)" },
  { input: "device-cmyk(0.8 0 0.4 0.13 / 0.8)", output: "rgba(44, 222, 133, 0.8)" },
  {
    input: "device-cmyk(25% 75% 8% 3% / 81.3%)",
    output: "rgba(186, 62, 228, 0.813)"
  }
]
#+end_src

***** Functional HWB Conversion

HWB is another polar coordinate translation in the RGB space meaning that the only way forward is back.

