internals/color/conversions.js

// [[file:../../README.org::*Functional RGB to Oklab (LCh)][Functional RGB to Oklab (LCh):1]]
function calcOklab(r, g, b) {
  const [R, G, B] = removeGamma([r, g, b]);

  // Convert to LMS cone activations and apply non-linearity
  const [L, M, S] = [
    R * 0.4122214708 + G * 0.5363325363 + B * 0.0514459929,
    R * 0.2119034982 + G * 0.6806995451 + B * 0.1073969566,
    R * 0.0883024619 + G * 0.2817188376 + B * 0.6299787005,
  ].map((V) => Math.cbrt(V));

  // Calculate Oklab values
  return [
    L * 0.2104542553 + M * 0.793617785 - S * 0.0040720468,
    L * 1.9779984951 - M * 2.428592205 + S * 0.4505937099,
    L * 0.0259040371 + M * 0.7827717662 - S * 0.808675766,
  ];
}

export function rgbToOklab(color) {
  const [r, g, b, alpha] = parseRGB(color);
  const [l, aHue, bHue] = calcOklab(r, g, b);

  const L = `${enforcePrecision(calcPercentFromFraction(l))}%`;
  const c = enforcePrecision(Math.sqrt(aHue ** 2 + bHue ** 2));
  const h = enforcePrecision(Math.atan2(bHue, aHue) * (180 / Math.PI));

  const C = Math.sign(Math.round(c)) === 0 ? 0 : c; // Ensure negative values lock at 0
  const H = Math.sign(h) === -1 ? correctHueCounterClockwise(h) : h;

  const A = (alpha && (alpha ?? 1)) || 1;

  return A === 1 ? `oklab(${L} ${C} ${H})` : `oklab(${L} ${C} ${H} / ${A})`;
}
// Functional RGB to Oklab (LCh):1 ends here

// [[file:../../README.org::*Functional RGB from Functional HSL][Functional RGB from Functional HSL:1]]
import {
  calcChannelFromFraction,
  calcHueFromGrad,
  calcHueFromTurn,
  correctHueClockwise,
} from "./math.js";

// https://www.rapidtables.com/convert/color/hsl-to-rgb.html
const calcChannels = (C, X, H) =>
  new Map([
    [[C, X, 0], 0 <= H && H < 60],
    [[X, C, 0], 60 <= H && H < 120],
    [[0, C, X], 120 <= H && H < 180],
    [[0, X, C], 180 <= H && H < 240],
    [[X, 0, C], 240 <= H && H < 300],
    [[C, 0, X], 300 <= H && H < 360],
  ]);

function parseHSL(color) {
  const [h, s, l, alpha] = valueExtractor(color);

  const [H] = [h].map((value) => {
    const n = parseFloat(value);
    const isNegative = (n) => Math.sign(n) === -1;
    let hue;

    // Set hue based on unit
    if (value.endsWith("grad")) {
      hue = isNegative(n) ? calcHueFromGrad(n + 400) : calcHueFromGrad(n);
    } else if (value.endsWith("rad")) {
      hue = isNegative(n) ? calcHueFromRad(n + 6.28319) : calcHueFromRad(n);
    } else if (value.endsWith("turn")) {
      hue = isNegative(n) ? calcHueFromTurn(n + 1) : calcHueFromTurn(n);
    } else {
      hue = n;
    }

    // hue correction
    let degrees;
    if (hue >= 360) {
      degrees = correctHueClockwise(hue);
    } else if (isNegative(hue)) {
      degrees = correctHueClockwise(correctHueCounterClockwise(hue));
    } else {
      degrees = hue;
    }

    return degrees;
  });

  const [S, L] = [s, l].map((value) => {
    const n = parseFloat(value);
    return calcFractionFromPercent(n);
  });

  const a = parseFloat(alpha);
  const A = a != null ? (a > 1 ? calcFractionFromPercent(a) : a) : 1;

  return A === 1 ? [H, S, L] : [H, S, L, A];
}

function calcRGB(h, s, l) {
  // Calculate chroma
  const C = (1 - Math.abs(2 * l - 1)) * s;
  const X = C * (1 - Math.abs(((h / 60) % 2) - 1));
  const m = l - C / 2;

  // Evaluate channels
  const [R, G, B] = Array.from(calcChannels(C, X, h))
    .filter(([, condition]) => condition)
    .flatMap(([evaluation]) => evaluation)
    .map((channel) => Math.round(calcChannelFromFraction(channel + m)));

  return [R, G, B];
}
// Functional RGB from Functional HSL:1 ends here

// [[file:../../README.org::*Functional RGB from Functional HSL][Functional RGB from Functional HSL:2]]
/** Functional RGB from Functional HSL */
export function rgbFromHSL(color) {
  const [h, s, l, alpha] = parseHSL(color);
  const [R, G, B] = calcRGB(h, s, l);

  const A = (alpha && (alpha ?? 1)) || 1;

  return A === 1 ? `rgb(${R}, ${G}, ${B})` : `rgba(${R}, ${G}, ${B}, ${A})`;
}
// Functional RGB from Functional HSL:2 ends here

// [[file:../../README.org::*Functional RGB from Device CMYK][Functional RGB from Device CMYK:1]]
function parseCMYK(color) {
  const [c, m, y, k, alpha] = valueExtractor(color);
  const value = (s) => parseFloat(s);
  const [C, M, Y, K] = [c, m, y, k].map((component) =>
    component.endsWith("%")
      ? calcFractionFromPercent(value(component))
      : value(component)
  );

  const a = value(alpha);
  const A = a != null ? (a > 1 ? calcFractionFromPercent(a) : a) : 1;

  return A === 1 ? [C, M, Y, K] : [C, M, Y, K, A];
}
// Functional RGB from Device CMYK:1 ends here

// [[file:../../README.org::*Functional RGB from Device CMYK][Functional RGB from Device CMYK:2]]
/** Functional RGB from Device CMYK */
export function rgbFromCMYK(color) {
  const [C, M, Y, K, alpha] = parseCMYK(color);

  const [R, G, B] = [C, M, Y].map((component) =>
    Math.round(calcChannelFromFraction((1 - component) * (1 - K)))
  );
  const A = (alpha && (alpha ?? 1)) || 1;

  return A === 1 ? `rgb(${R}, ${G}, ${B})` : `rgba(${R}, ${G}, ${B}, ${A})`;
}
// Functional RGB from Device CMYK:2 ends here
