README.org
****** Functional RGB from Functional HWB

As with the progressive conversion, the regressive conversion is a composite. It first splits the
hue with a call to =calcRGB()= from the HSL conversion module, setting the saturation and lightness to
return a pure hue, then modifies the result with the given amount of white and black.

Again, the implementation uses [[https://www.w3.org/TR/css-color-4/#hwb-to-rgb][a formula ripped straight from the spec]] with some modifications.

First, ensuring uniform output:

#+BEGIN_SRC js :tangle "./internals/color/conversions.js" :comments link
function parseHWB(color) {
  const [h, w, blk, alpha] = valueExtractor(color);
  const [H] = parseHSL(`hsl(${h}, 50%, 50%)`); // free hue correction
  const [W, BLK] = [w, blk].map((component) =>
    calcFractionFromPercent(parseFloat(component))
  );

  const a = parseFloat(alpha);
  const A = a != null ? (a > 1 ? calcFractionFromPercent(a) : a) : 1;

  return A === 1 ? [H, W, BLK] : [H, W, BLK, A];
}
#+END_SRC

And now for the conversion algorithm.

#+BEGIN_SRC js :tangle "./internals/color/conversions.js" :comments link
/** Functional RGB from Functional HWB */
function rgbFromHWB(color) {
  const [h, w, blk, alpha] = parseHWB(color);
  const [r, g, b] = calcRGB(h, 1, 0.5);

  const A = (alpha && (alpha ?? 1)) || 1;

  // Achromatic
  if (w + blk >= 1) {
    const GRAY = Math.round(calcChannelFromFraction(w / (w + blk)));
    return A === 1
      ? `rgb(${GRAY}, ${GRAY}, ${GRAY})`
      : `rgba(${GRAY}, ${GRAY}, ${GRAY}, ${A})`;
  }

  const [R, G, B] = [r, g, b].map((channel) =>
    Math.round(
      calcChannelFromFraction(
        calcFractionFromChannel(channel) * (1 - w - blk) + w,
      ),
    )
  );

  return A === 1 ? `rgb(${R}, ${G}, ${B})` : `rgba(${R}, ${G}, ${B}, ${A})`;
}
#+END_SRC

Now the fun part: seeing if anything breaks.

#+BEGIN_SRC js :results output code replace :allow read :noweb yes
const { rgbFromHWB } = await import(`${Deno.cwd()}/internals/color/conversions.js`);

<<valid-hwb>>

console.log(colors.map((color) => ({input: color, output: rgbFromHWB(color)})));
#+END_SRC

#+NAME: rgb-from-hwb
#+begin_src js
[
  { input: "hwb(0 0% 100%)", output: "rgb(0, 0, 0)" },
  { input: "hwb(0 100% 100%)", output: "rgb(128, 128, 128)" },
  { input: "hwb(0 100% 0%)", output: "rgb(255, 255, 255)" },
  { input: "hwb(0 0% 0%)", output: "rgb(255, 0, 0)" },
  { input: "hwb(60 0% 0%)", output: "rgb(255, 255, 0)" },
  { input: "hwb(120 0% 0%)", output: "rgb(0, 255, 0)" },
  { input: "hwb(180 0% 0%)", output: "rgb(0, 255, 255)" },
  { input: "hwb(240 0% 0%)", output: "rgb(0, 0, 255)" },
  { input: "hwb(300 0% 0%)", output: "rgb(255, 0, 255)" },
  { input: "hwb(188 20% 3%)", output: "rgb(51, 221, 247)" },
  { input: "hwb(3.1rad 50% 0%)", output: "rgb(128, 255, 250)" },
  { input: "hwb(183grad 5% 15% / 0.5)", output: "rgba(13, 217, 165, 0.5)" },
  { input: "hwb(0.8turn 38% 99%)", output: "rgb(71, 71, 71)" }
]
#+end_src

Looks like we're golden.

***** Functional CIELAB Conversion

CIELAB is a fork in the road: you can convert to its polar coordinate CIELCh(ab) or derive an RGB
color from it.

****** Functional RGB from Functional CIELAB

The [[http://www.brucelindbloom.com/index.html?Equations.html][formula for regressing CIELAB to CIE XYZ]] is cleanly outlined. So, I'll follow that.

#+BEGIN_SRC js :tangle "./internals/color/conversions.js" :comments link
function calcXYZLab(l, a, b) {
  const [L, A, B] = [l, a, b].map((v) => parseFloat(v));

  // CIE standards
  const  = 216 / 24389;
  const  = 24389 / 27;
  const white = [0.96422, 1.0, 0.82521]; // D50 reference white

  // Compute the values of F
  const Fy = (L + 16) / 116;
  const Fx = A / 500 + Fy;
  const Fz = Fy - B / 200;

  // Calculate xyz
  const [x, y, z] = [
    Fx ** 3 >  ? Fx ** 3 : (116 * Fx - 16) / ,
    L >  *  ? Fy ** 3 : L / ,
    Fz ** 3 >  ? Fz ** 3 : (116 * Fz - 16) / ,
  ];

  return [x, y, z].map((V, i) => V * white[i]);
}
#+END_SRC

The next step is converting the D50 XYZ to sRGB native D65 XYZ via chromatic adaptation.

And /then/ passing it through the inverse transformation matrix to get linear RGB.

#+BEGIN_SRC js :tangle "./internals/color/conversions.js" :comments link
function calcLinearRGB(l, a, b) {
  const [x, y, z] = calcXYZLab(l, a, b);

  /**
   * D65 transformation matrix
   * =============================
   * 0.9555766 -0.0230393  0.0631636
   * -0.0282895  1.0099416  0.0210077
   * 0.0122982 -0.0204830  1.3299098
   * =============================
   */
  const [X, Y, Z] = [
    x * 0.9555766 + y * -0.0230393 + z * 0.0631636,
    x * -0.0282895 + y * 1.0099416 + z * 0.0210077,
    x * 0.0122982 + y * -0.020483 + z * 1.3299098,
  ];

  /**
   * linear sRGB transformation matrix (inverse)
   * =============================
   *  3.2404542 -1.5371385 -0.4985314
   * -0.9692660  1.8760108  0.0415560
   *  0.0556434 -0.2040259  1.0572252
   * =============================
   */
  return [
    X * 3.2404542 + Y * -1.5371385 + Z * -0.4985314,
    X * -0.969266 + Y * 1.8760108 + Z * 0.041556,
    X * 0.0556434 + Y * -0.2040259 + Z * 1.0572252,
  ];
}
#+END_SRC

Gamma application is the finishing touch before converting the channel values to the expected =0-255=
range.

#+BEGIN_SRC js :tangle "./internals/color/conversions.js" :comments link
const applyGamma = (lrgb) =>
  lrgb.map((V) => V <= 0.0031308 ? 12.92 * V : 1.055 * V ** (1 / 2.4) - 0.055);

/** Functional CIELAB from Functional RGB */
export function rgbFromCielab(color) {
  const [l, aHue, bHue, alpha] = valueExtractor(color);
  const [r, g, b] = calcLinearRGB(l, aHue, bHue);

  const [R, G, B] = applyGamma([r, g, b]).map((channel) =>
    Math.round(normalize(0, calcChannelFromFraction(channel), 255))
  );
  const A = (alpha &&
    (alpha.endsWith("%")
      ? calcFractionFromPercent(parseFloat(alpha))
      : alpha)) ||
    1;

  return A === 1 ? `rgb(${R}, ${G}, ${B})` : `rgba(${R}, ${G}, ${B}, ${A})`;
}
#+END_SRC

That was a lot to parse. Time to see if the calculations check out.

#+BEGIN_SRC js :results output code replace :allow read :noweb yes
const { rgbFromCielab } = await import(`${Deno.cwd()}/internals/color/conversions.js`);

<<valid-cielab>>

console.log(colors.map((color) => ({input: color, output: rgbFromCielab(color)})));
#+END_SRC

#+RESULTS:
#+begin_src js
[
  { input: "lab(0% 0 0)", output: "rgb(0, 0, 0)" },
  { input: "lab(53.59% 0 0)", output: "rgb(128, 128, 128)" },
  { input: "lab(100% 0 0)", output: "rgb(255, 255, 255)" },
  { input: "lab(54.29% 80.81 69.89)", output: "rgb(255, 0, 0)" },
  { input: "lab(97.6% -15.75 93.39)", output: "rgb(255, 255, 0)" },
  { input: "lab(87.82% -79.29 80.99)", output: "rgb(0, 255, 0)" },
  { input: "lab(90.67% -50.67 -14.96)", output: "rgb(0, 255, 255)" },
  { input: "lab(29.57% 68.3 -112.03)", output: "rgb(0, 0, 255)" },
  { input: "lab(60.17% 93.55 -60.5)", output: "rgb(255, 0, 255)" },
  { input: "lab(49.18% 38.1 -110.33)", output: "rgb(0, 102, 255)" },
  { input: "lab(91.3% -93 14)", output: "rgb(0, 255, 199)" },
  { input: "lab(83.119% 49.34 -3.99 / 0.75)", output: "rgba(255, 169, 217, 0.75)" },
  { input: "lab(199% 38 13 / 78%)", output: "rgba(255, 255, 255, 0.78)" }
]
#+end_src

I'll stamp this as Good Enough.

****** Functional CIELAB to Functional CIELCh(ab)

The final bridge is a progressive conversion of CIELAB to CIELCh(ab). With this, all known and proposed
CSS color formats are supported by the Quarks System Core.

And thankfully, [[http://www.brucelindbloom.com/Eqn_Lab_to_LCH.html][the formula]] is a dead simple conversion of rectangle coordinates to polar coordinates.

#+BEGIN_SRC js :tangle "./internals/color/conversions.js" :comments link
/** Functional CIELAB to Functional CIELCh(ab) */
function cielabToCielch(color) {
  const [L, a, b, alpha] = valueExtractor(color);
  const [C, h] = [
    enforcePrecision(Math.sqrt(parseFloat(a) ** 2 + parseFloat(b) ** 2)),
    enforcePrecision(
      Math.atan2(parseFloat(b), parseFloat(a)) * (180 / Math.PI),
    ),
  ];

  const H = Math.sign(h) === -1 ? h + 360 : h;

  const A = (alpha &&
    (alpha.endsWith("%")
      ? calcFractionFromPercent(parseFloat(alpha))
      : alpha)) ||
    1;

  return A === 1 ? `lch(${L} ${C} ${H})` : `lch(${L} ${C} ${H} / ${A})`;
}
#+END_SRC

Now to make sure it returns what I expect.

#+BEGIN_SRC js :results output code replace :allow read :noweb yes
const { cielabToCielch } = await import(`${Deno.cwd()}/internals/color/conversions.js`);

<<valid-cielab>>

console.log(colors.map((color) => ({input: color, output: cielabToCielch(color)})));
#+END_SRC

#+NAME: cielab-to-cielch
#+begin_src js
[
  { input: "lab(0% 0 0)", output: "lch(0% 0 0)" },
  { input: "lab(53.59% 0 0)", output: "lch(53.59% 0 0)" },
  { input: "lab(100% 0 0)", output: "lch(100% 0 0)" },
  { input: "lab(54.29% 80.81 69.89)", output: "lch(54.29% 106.8 40.86)" },
  { input: "lab(97.6% -15.75 93.39)", output: "lch(97.6% 94.71 99.57)" },
  { input: "lab(87.82% -79.29 80.99)", output: "lch(87.82% 113.3 134.4)" },
  { input: "lab(90.67% -50.67 -14.96)", output: "lch(90.67% 52.83 196.4)" },
  { input: "lab(29.57% 68.3 -112.03)", output: "lch(29.57% 131.2 301.37)" },
  { input: "lab(60.17% 93.55 -60.5)", output: "lch(60.17% 111.4 327.11)" },
  { input: "lab(49.18% 38.1 -110.33)", output: "lch(49.18% 116.7 289.05)" },
  { input: "lab(91.3% -93 14)", output: "lch(91.3% 94.05 171.4)" },
  {
    input: "lab(83.119% 49.34 -3.99 / 0.75)",
    output: "lch(83.119% 49.5 355.377 / 0.75)"
  },
  { input: "lab(199% 38 13 / 78%)", output: "lch(199% 40.16 18.89 / 0.78)" }
]
#+end_src

That'll do it.

***** Functional CIELCh Conversion

This final conversion ends the chain and allows any supported format to convert to and from any
other supported format.

