internals/color/conversions.js

// [[file:../../README.org::*Functional RGB from Functional HWB][Functional RGB from Functional HWB:1]]
function parseHWB(color) {
  const [h, w, blk, alpha] = valueExtractor(color);
  const [H] = parseHSL(`hsl(${h}, 50%, 50%)`); // free hue correction
  const [W, BLK] = [w, blk].map((component) =>
    calcFractionFromPercent(parseFloat(component))
  );

  const a = parseFloat(alpha);
  const A = a != null ? (a > 1 ? calcFractionFromPercent(a) : a) : 1;

  return A === 1 ? [H, W, BLK] : [H, W, BLK, A];
}
// Functional RGB from Functional HWB:1 ends here

// [[file:../../README.org::*Functional RGB from Functional HWB][Functional RGB from Functional HWB:2]]
/** Functional RGB from Functional HWB */
export function rgbFromHWB(color) {
  const [h, w, blk, alpha] = parseHWB(color);
  const [r, g, b] = calcRGB(h, 1, 0.5);

  const A = (alpha && (alpha ?? 1)) || 1;

  // Achromatic
  if (w + blk >= 1) {
    const GRAY = Math.round(calcChannelFromFraction(w / (w + blk)));
    return A === 1
      ? `rgb(${GRAY}, ${GRAY}, ${GRAY})`
      : `rgba(${GRAY}, ${GRAY}, ${GRAY}, ${A})`;
  }

  const [R, G, B] = [r, g, b].map((channel) =>
    Math.round(
      calcChannelFromFraction(
        calcFractionFromChannel(channel) * (1 - w - blk) + w,
      ),
    )
  );

  return A === 1 ? `rgb(${R}, ${G}, ${B})` : `rgba(${R}, ${G}, ${B}, ${A})`;
}
// Functional RGB from Functional HWB:2 ends here

// [[file:../../README.org::*Functional RGB from Functional CIELAB][Functional RGB from Functional CIELAB:1]]
function calcXYZLab(l, a, b) {
  const [L, A, B] = [l, a, b].map((v) => parseFloat(v));

  // CIE standards
  const ε = 216 / 24389;
  const κ = 24389 / 27;
  const white = [0.96422, 1.0, 0.82521]; // D50 reference white

  // Compute the values of F
  const Fy = (L + 16) / 116;
  const Fx = A / 500 + Fy;
  const Fz = Fy - B / 200;

  // Calculate xyz
  const [x, y, z] = [
    Fx ** 3 > ε ? Fx ** 3 : (116 * Fx - 16) / κ,
    L > κ * ε ? Fy ** 3 : L / κ,
    Fz ** 3 > ε ? Fz ** 3 : (116 * Fz - 16) / κ,
  ];

  return [x, y, z].map((V, i) => V * white[i]);
}
// Functional RGB from Functional CIELAB:1 ends here

// [[file:../../README.org::*Functional RGB from Functional CIELAB][Functional RGB from Functional CIELAB:2]]
function calcLinearRGB(l, a, b) {
  const [x, y, z] = calcXYZLab(l, a, b);

  /**
   * D65 transformation matrix
   * =============================
   * 0.9555766 -0.0230393  0.0631636
   * -0.0282895  1.0099416  0.0210077
   * 0.0122982 -0.0204830  1.3299098
   * =============================
   */
  const [X, Y, Z] = [
    x * 0.9555766 + y * -0.0230393 + z * 0.0631636,
    x * -0.0282895 + y * 1.0099416 + z * 0.0210077,
    x * 0.0122982 + y * -0.020483 + z * 1.3299098,
  ];

  /**
   * linear sRGB transformation matrix (inverse)
   * =============================
   *  3.2404542 -1.5371385 -0.4985314
   * -0.9692660  1.8760108  0.0415560
   *  0.0556434 -0.2040259  1.0572252
   * =============================
   */
  return [
    X * 3.2404542 + Y * -1.5371385 + Z * -0.4985314,
    X * -0.969266 + Y * 1.8760108 + Z * 0.041556,
    X * 0.0556434 + Y * -0.2040259 + Z * 1.0572252,
  ];
}
// Functional RGB from Functional CIELAB:2 ends here

// [[file:../../README.org::*Functional RGB from Functional CIELAB][Functional RGB from Functional CIELAB:3]]
const applyGamma = (lrgb) =>
  lrgb.map((V) => V <= 0.0031308 ? 12.92 * V : 1.055 * V ** (1 / 2.4) - 0.055);

/** Functional CIELAB from Functional RGB */
export function rgbFromCielab(color) {
  const [l, aHue, bHue, alpha] = valueExtractor(color);
  const [r, g, b] = calcLinearRGB(l, aHue, bHue);

  const [R, G, B] = applyGamma([r, g, b]).map((channel) =>
    Math.round(normalize(0, calcChannelFromFraction(channel), 255))
  );
  const A = (alpha &&
    (alpha.endsWith("%")
      ? calcFractionFromPercent(parseFloat(alpha))
      : alpha)) ||
    1;

  return A === 1 ? `rgb(${R}, ${G}, ${B})` : `rgba(${R}, ${G}, ${B}, ${A})`;
}
// Functional RGB from Functional CIELAB:3 ends here

// [[file:../../README.org::*Functional CIELAB to Functional CIELCh(ab)][Functional CIELAB to Functional CIELCh(ab):1]]
/** Functional CIELAB to Functional CIELCh(ab) */
export function cielabToCielch(color) {
  const [L, a, b, alpha] = valueExtractor(color);
  const [C, h] = [
    enforcePrecision(Math.sqrt(parseFloat(a) ** 2 + parseFloat(b) ** 2)),
    enforcePrecision(
      Math.atan2(parseFloat(b), parseFloat(a)) * (180 / Math.PI),
    ),
  ];

  const H = Math.sign(h) === -1 ? h + 360 : h;

  const A = (alpha &&
    (alpha.endsWith("%")
      ? calcFractionFromPercent(parseFloat(alpha))
      : alpha)) ||
    1;

  return A === 1 ? `lch(${L} ${C} ${H})` : `lch(${L} ${C} ${H} / ${A})`;
}
// Functional CIELAB to Functional CIELCh(ab):1 ends here

// [[file:../../README.org::*Functional CIELAB from Functional CIELCh(ab)][Functional CIELAB from Functional CIELCh(ab):1]]
/** Functional CIELAB from Functional CIELCh(ab) */
