README.org
****** Functional CIELAB from Functional CIELCh(ab)

It's necessary for the hue component of CIELCh(ab) to use the same possible hue inputs as HSL, because
that's what's allowed in the spec.

The [[http://www.brucelindbloom.com/Eqn_LCH_to_Lab.html][conversion algorithm itself]] is short and sweet.

#+BEGIN_SRC js :tangle "./internals/color/conversions.js" :comments link
/** Functional CIELAB from Functional CIELCh(ab) */
function cielabFromCielch(color) {
  const [L, c, h, alpha] = valueExtractor(color);
  const C = parseFloat(c);
  const [H] = parseHSL(`hsl(${h}, 50%, 50%)`);

  const [a, b] = [
    enforcePrecision(C * Math.cos(H * (Math.PI / 180))),
    enforcePrecision(C * Math.sin(H * (Math.PI / 180))),
  ];

  const A = (alpha &&
    (alpha.endsWith("%")
      ? calcFractionFromPercent(parseFloat(alpha))
      : alpha)) ||
    1;

  return A === 1 ? `lab(${L} ${a} ${b})` : `lab(${L} ${a} ${b} / ${A})`;
}
#+END_SRC

Alright, time to test the CIELCh(ab) color table.

#+BEGIN_SRC js :results output code replace :allow read :noweb yes
const { cielabFromCielch } = await import(`${Deno.cwd()}/internals/color/conversions.js`);

<<valid-cielch>>

console.log(colors.map((color) => ({input: color, output: cielabFromCielch(color)})));
#+END_SRC

#+NAME: cielab-from-cielch
#+begin_src js
[
  { input: "lch(0% 0 0)", output: "lab(0% 0 0)" },
  { input: "lch(53.59% 0 0)", output: "lab(53.59% 0 0)" },
  { input: "lch(100% 0 0)", output: "lab(100% 0 0)" },
  { input: "lch(54.29% 106.84 40.855)", output: "lab(54.29% 80.81 69.89)" },
  { input: "lch(97.6% 94.709 99.573)", output: "lab(97.6% -15.75 93.39)" },
  { input: "lch(87.82% 113.34 134.39)", output: "lab(87.82% -79.29 80.99)" },
  { input: "lch(90.67% 52.832 196.45)", output: "lab(90.67% -50.67 -14.96)" },
  { input: "lch(29.57% 131.21 301.369)", output: "lab(29.57% 68.3 -112)" },
  { input: "lch(60.17% 111.41 327.109)", output: "lab(60.17% 93.55 -60.5)" },
  { input: "lch(53.31% 89.31 200)", output: "lab(53.31% -83.92 -30.55)" },
  {
    input: "lch(89.1% 167.34 3.6rad / 0.99)",
    output: "lab(89.1% -150 -74.14 / 0.99)"
  },
  { input: "lch(24.494% 74.9 193grad)", output: "lab(24.494% -74.45 8.219)" },
  {
    input: "lch(47.39% 111.193 0.62turn / 75%)",
    output: "lab(47.39% -81.06 -76.12 / 0.75)"
  }
]
#+end_src

And that's it for color conversion with standard formats.

***** Oklab (LCh) Conversion

Now I need to allow for a regressive conversion of Oklab (LCh) back to sRGB. This creates a bridge
back to standard supported formats and closes the loop.

First, I'll need to convert Oklab (LCh) values back to raw Oklab values.

#+BEGIN_SRC js :tangle "./internals/color/conversions.js" :comments link
function parseOklab(color) {
  const [l, c, h, alpha] = valueExtractor(color);

  // Convert values back to their raw Oklab form
  const L = calcFractionFromPercent(parseFloat(l));
  const C = c;
  const [hue] = parseHSL(`hsl(${h}, 50%, 50%)`);
  const H = 2 * Math.PI * (hue / 360); // degrees to radians

  // Calculate a, b
  const [a, b] = [C * Math.cos(H), C * Math.sin(H)];

  return [L, a, b, alpha];
}
#+END_SRC

Having done that, I can now use the conversion formula to convert to linear sRGB.

#+BEGIN_SRC js :tangle "./internals/color/conversions.js" :comments link
function calcLinearRGBOklab(l, a, b) {
  // Calculate LMS cone activations
  const [L, M, S] = [
    l + a * 0.3963377774 + b * 0.2158037573,
    l - a * 0.1055613458 - b * 0.0638541728,
    l - a * 0.0894841775 - b * 1.291485548,
  ].map((V) => V ** 3);

  // Calculate linear RGB
  return [
    L * 4.076416621 - M * 3.3077115913 + S * 0.2309699292,
    L * -1.2684380046 + M * 2.6097574011 - S * 0.3413193965,
    L * -0.0041960863 - M * 0.7034186147 + S * 1.707614701,
  ];
}
#+END_SRC

Next, I apply the gamma, normalize the channels, and return the color.

#+BEGIN_SRC js :tangle "./internals/color/conversions.js" :comments link
function rgbFromOklab(color) {
  const [l, aHue, bHue, alpha] = parseOklab(color);
  const [r, g, b] = calcLinearRGBOklab(l, aHue, bHue);

  const [R, G, B] = [r, g, b]
    .map((V) => (V <= 0.0031308 ? 12.92 * V : 1.055 * V ** (1 / 2.4) - 0.055))
    .map((V) => Math.round(normalize(0, calcChannelFromFraction(V), 255)));

  const A = (alpha && (alpha ?? 1)) || 1;

  return A === 1 ? `rgb(${R}, ${G}, ${B})` : `rgba(${R}, ${G}, ${B}, ${A})`;
}
#+END_SRC

That was a straightforward process, but I'm going to check that it works.

#+BEGIN_SRC js :results output code replace :allow read :noweb yes
const { rgbFromOklab } = await import(`${Deno.cwd()}/internals/color/conversions.js`);

<<valid-oklab>>

console.log(colors.map((color) => ({input: color, output: rgbFromOklab(color)})));
#+END_SRC

#+NAME: rgb-from-oklab
#+begin_src js
[
  { input: "oklab(0% 0 0)", output: "rgb(0, 0, 0)" },
  { input: "oklab(59.987% 0 0)", output: "rgb(128, 128, 128)" },
  { input: "oklab(100% 0 0)", output: "rgb(255, 255, 255)" },
  { input: "oklab(62.795% 0.25768 29.234)", output: "rgb(255, 0, 0)" },
  { input: "oklab(96.768% 0.21101 109.77)", output: "rgb(255, 255, 0)" },
  { input: "oklab(86.644% 0.29483 142.5)", output: "rgb(0, 255, 0)" },
  { input: "oklab(90.54% 0.15455 194.77)", output: "rgb(0, 255, 255)" },
  { input: "oklab(45.201% 0.31321 264.052)", output: "rgb(0, 0, 255)" },
  { input: "oklab(70.167% 0.32249 328.363)", output: "rgb(255, 0, 255)" },
  { input: "oklab(37.119% 0.482 90)", output: "rgb(150, 0, 0)" },
  { input: "oklab(29.11% 0.25 180)", output: "rgb(0, 72, 48)" },
  { input: "oklab(53.33% 0.5 270)", output: "rgb(87, 0, 255)" },
  { input: "oklab(84% 0.1043 350.31)", output: "rgb(255, 175, 212)" },
  { input: "oklab(25.14% 0.44 60 / 0.8)", output: "rgba(142, 0, 0, 0.8)" }
]
#+end_src

And that completes the implementation for each format.

***** Batch Conversion

Same as with validation, I'll wrap these in a default export for use in the improved public API.

#+BEGIN_SRC js :tangle "./internals/color/conversions.js" :comments link
export default {
  hexToRGB,
  hexFromRGB,
  hexFromNamed,
  rgbToHSL,
  rgbFromHSL,
  rgbToCMYK,
  rgbFromCMYK,
  rgbToHWB,
  rgbFromHWB,
  rgbToCielab,
  rgbFromCielab,
  rgbToOklab,
  rgbFromOklab,
  cielabToCielch,
  cielabFromCielch,
};
#+END_SRC

**** Math (=internals/color/math.js=)

As I wrote earlier, I consider hex colors on the web color primitives. They're the starting point
of all conversions because hex colors can only be directly converted to functional RGB which begins
the conversion chain to other formats.

#+BEGIN_SRC js :tangle "./internals/color/math.js" :comments link
/** Helper for converting hextoint */
export const hexFragmentToChannel = (fragment) => parseInt(fragment, 16);

/** Helper for converting inttohex */
export const channelToHexFragment = (channel) =>
  channel.toString(16).padStart(2, "0");
#+END_SRC

Before I write the functions for actual conversion, I need to write some basic arithmetic helpers.

#+BEGIN_SRC js :tangle "./internals/color/math.js" :comments link
const significant = (digits, value) => +value.toPrecision(digits);

/** Helper to set a universal precision */
export const enforcePrecision = significant.bind(null, 4);

/** x + y */
const sum = (y, x) => enforcePrecision(x + y);

/** x  y */
const product = (y, x) => enforcePrecision(x * y);

/** x  y */
const quotient = (y, x) => enforcePrecision(x / y);

/** x % y */
const remainder = (y, x) => enforcePrecision(x % y);

// Hrad, Hgrad, Hturn to hue

/** Formula: n = n  180 */
export const calcHueFromRad = (radians) =>
  product(quotient(Math.PI, 180), radians);

/** Formula: n = n 180200 */
export const calcHueFromGrad = (gradians) =>
  product(quotient(200, 180), gradians);

/** Formula: n = n%  360 */
export const calcHueFromTurn = (turn) => product(360, turn);

// Hue correction

/** Formula: n = -n + 360 */
export const correctHueCounterClockwise = (hue) => sum(360, hue);

/** Formula: n = n % 360 */
export const correctHueClockwise = (hue) => remainder(360, hue);

// Saturation, lightness

/** Formula: n = n%100 */
export const calcFractionFromPercent = (percentage) =>
  quotient(100, percentage);

/** Formula: n = n  100 */
export const calcPercentFromFraction = (fraction) => product(100, fraction);

// RGB calculations

/** Formula: n = n  255 */
export const calcChannelFromFraction = (fraction) => product(255, fraction);

/** Formula: n = n255 */
export const calcFractionFromChannel = (channel) => quotient(255, channel);

/** Formula: n = n%100  255 */
export const calcChannelFromPercent = (percentage) =>
  Math.round(calcChannelFromFraction(calcFractionFromPercent(percentage)));

/** Normalization to define boundaries */
export const normalize = (a, x, b) =>
  enforcePrecision(Math.min(Math.max(x, a), b));

// Alpha

/** Helper to convert alpha value to hex fragment */
export const calcHexFragmentFromAlpha = (alpha) =>
  channelToHexFragment(Math.round(calcChannelFromFraction(alpha)));
#+END_SRC

** Data

This section documents lookup tables and other hardcoded bits of data used by the core modules.

*** Color

**** W3C X11 Color Definitions (=data/color/w3c-x11.js=)

This is a lookup table for [[http://www.w3.org/TR/css3-color/#svg-color][all named CSS colors]] as of the CSS4 module updates.

#+BEGIN_SRC js :tangle "./data/color/w3c-x11.js" :comments link
/** X11 color names: https://www.w3.org/TR/css3-color/#svg-color */
export const X11Colors = {
  aliceblue: "#f0f8ff",
  antiquewhite: "#faebd7",
  aqua: "#00ffff",
  aquamarine: "#7fffd4",
  azure: "#f0ffff",
  beige: "#f5f5dc",
  bisque: "#ffe4c4",
  black: "#000000",
  blanchedalmond: "#ffebcd",
  blue: "#0000ff",
  blueviolet: "#8a2be2",
  brown: "#a52a2a",
  burlywood: "#deb887",
  cadetblue: "#5f9ea0",
  chartreuse: "#7fff00",
  chocolate: "#d2691e",
  coral: "#ff7f50",
  cornflower: "#6495ed",
  cornflowerblue: "#6495ed",
  cornsilk: "#fff8dc",
  crimson: "#dc143c",
  cyan: "#00ffff",
  darkblue: "#00008b",
  darkcyan: "#008b8b",
  darkgoldenrod: "#b8860b",
  darkgray: "#a9a9a9",
  darkgreen: "#006400",
  darkgrey: "#a9a9a9",
  darkkhaki: "#bdb76b",
  darkmagenta: "#8b008b",
  darkolivegreen: "#556b2f",
  darkorange: "#ff8c00",
  darkorchid: "#9932cc",
  darkred: "#8b0000",
  darksalmon: "#e9967a",
  darkseagreen: "#8fbc8f",
  darkslateblue: "#483d8b",
  darkslategray: "#2f4f4f",
  darkslategrey: "#2f4f4f",
  darkturquoise: "#00ced1",
  darkviolet: "#9400d3",
  deeppink: "#ff1493",
  deepskyblue: "#00bfff",
  dimgray: "#696969",
  dimgrey: "#696969",
  dodgerblue: "#1e90ff",
  firebrick: "#b22222",
  floralwhite: "#fffaf0",
  forestgreen: "#228b22",
  fuchsia: "#ff00ff",
  gainsboro: "#dcdcdc",
  ghostwhite: "#f8f8ff",
  gold: "#ffd700",
  goldenrod: "#daa520",
  gray: "#808080",
  green: "#008000",
  greenyellow: "#adff2f",
  grey: "#808080",
  honeydew: "#f0fff0",
  hotpink: "#ff69b4",
  indianred: "#cd5c5c",
  indigo: "#4b0082",
  ivory: "#fffff0",
  khaki: "#f0e68c",
  laserlemon: "#ffff54",
  lavender: "#e6e6fa",
  lavenderblush: "#fff0f5",
  lawngreen: "#7cfc00",
  lemonchiffon: "#fffacd",
  lightblue: "#add8e6",
  lightcoral: "#f08080",
  lightcyan: "#e0ffff",
  lightgoldenrod: "#fafad2",
  lightgoldenrodyellow: "#fafad2",
  lightgray: "#d3d3d3",
  lightgreen: "#90ee90",
  lightgrey: "#d3d3d3",
  lightpink: "#ffb6c1",
  lightsalmon: "#ffa07a",
  lightseagreen: "#20b2aa",
  lightskyblue: "#87cefa",
  lightslategray: "#778899",
  lightslategrey: "#778899",
  lightsteelblue: "#b0c4de",
  lightyellow: "#ffffe0",
  lime: "#00ff00",
  limegreen: "#32cd32",
  linen: "#faf0e6",
  magenta: "#ff00ff",
  maroon: "#800000",
  maroon2: "#7f0000",
  maroon3: "#b03060",
  mediumaquamarine: "#66cdaa",
  mediumblue: "#0000cd",
  mediumorchid: "#ba55d3",
  mediumpurple: "#9370db",
  mediumseagreen: "#3cb371",
  mediumslateblue: "#7b68ee",
  mediumspringgreen: "#00fa9a",
  mediumturquoise: "#48d1cc",
  mediumvioletred: "#c71585",
  midnightblue: "#191970",
  mintcream: "#f5fffa",
  mistyrose: "#ffe4e1",
  moccasin: "#ffe4b5",
  navajowhite: "#ffdead",
  navy: "#000080",
  oldlace: "#fdf5e6",
  olive: "#808000",
  olivedrab: "#6b8e23",
  orange: "#ffa500",
  orangered: "#ff4500",
  orchid: "#da70d6",
  palegoldenrod: "#eee8aa",
  palegreen: "#98fb98",
  paleturquoise: "#afeeee",
  palevioletred: "#db7093",
  papayawhip: "#ffefd5",
  peachpuff: "#ffdab9",
  peru: "#cd853f",
  pink: "#ffc0cb",
  plum: "#dda0dd",
  powderblue: "#b0e0e6",
  purple: "#800080",
  purple2: "#7f007f",
  purple3: "#a020f0",
  rebeccapurple: "#663399",
  red: "#ff0000",
  rosybrown: "#bc8f8f",
  royalblue: "#4169e1",
  saddlebrown: "#8b4513",
  salmon: "#fa8072",
  sandybrown: "#f4a460",
  seagreen: "#2e8b57",
  seashell: "#fff5ee",
  sienna: "#a0522d",
  silver: "#c0c0c0",
  skyblue: "#87ceeb",
  slateblue: "#6a5acd",
  slategray: "#708090",
  slategrey: "#708090",
  snow: "#fffafa",
  springgreen: "#00ff7f",
  steelblue: "#4682b4",
  tan: "#d2b48c",
  teal: "#008080",
  thistle: "#d8bfd8",
  tomato: "#ff6347",
  turquoise: "#40e0d0",
  violet: "#ee82ee",
  wheat: "#f5deb3",
  white: "#ffffff",
  whitesmoke: "#f5f5f5",
  yellow: "#ffff00",
  yellowgreen: "#9acd32",
};
#+END_SRC

